Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : OTP
// Version        : 1
// Bus type       : apb
// Description    : SNPS OTP control IF (SBPI and RPi wrapper control)
// =============================================================================
#ifndef _HARDWARE_REGS_OTP_H
#define _HARDWARE_REGS_OTP_H
// =============================================================================
// Register    : OTP_SW_LOCK0
// Description : Software lock register for page 0.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK0_OFFSET _u(0x00000000)
#define OTP_SW_LOCK0_BITS   _u(0x0000000f)
#define OTP_SW_LOCK0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK0_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK0_NSEC_RESET  "-"
#define OTP_SW_LOCK0_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK0_NSEC_MSB    _u(3)
#define OTP_SW_LOCK0_NSEC_LSB    _u(2)
#define OTP_SW_LOCK0_NSEC_ACCESS "RW"
#define OTP_SW_LOCK0_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK0_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK0_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK0_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK0_SEC_RESET  "-"
#define OTP_SW_LOCK0_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK0_SEC_MSB    _u(1)
#define OTP_SW_LOCK0_SEC_LSB    _u(0)
#define OTP_SW_LOCK0_SEC_ACCESS "RW"
#define OTP_SW_LOCK0_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK0_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK0_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK1
// Description : Software lock register for page 1.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK1_OFFSET _u(0x00000004)
#define OTP_SW_LOCK1_BITS   _u(0x0000000f)
#define OTP_SW_LOCK1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK1_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK1_NSEC_RESET  "-"
#define OTP_SW_LOCK1_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK1_NSEC_MSB    _u(3)
#define OTP_SW_LOCK1_NSEC_LSB    _u(2)
#define OTP_SW_LOCK1_NSEC_ACCESS "RW"
#define OTP_SW_LOCK1_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK1_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK1_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK1_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK1_SEC_RESET  "-"
#define OTP_SW_LOCK1_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK1_SEC_MSB    _u(1)
#define OTP_SW_LOCK1_SEC_LSB    _u(0)
#define OTP_SW_LOCK1_SEC_ACCESS "RW"
#define OTP_SW_LOCK1_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK1_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK1_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK2
// Description : Software lock register for page 2.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK2_OFFSET _u(0x00000008)
#define OTP_SW_LOCK2_BITS   _u(0x0000000f)
#define OTP_SW_LOCK2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK2_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK2_NSEC_RESET  "-"
#define OTP_SW_LOCK2_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK2_NSEC_MSB    _u(3)
#define OTP_SW_LOCK2_NSEC_LSB    _u(2)
#define OTP_SW_LOCK2_NSEC_ACCESS "RW"
#define OTP_SW_LOCK2_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK2_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK2_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK2_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK2_SEC_RESET  "-"
#define OTP_SW_LOCK2_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK2_SEC_MSB    _u(1)
#define OTP_SW_LOCK2_SEC_LSB    _u(0)
#define OTP_SW_LOCK2_SEC_ACCESS "RW"
#define OTP_SW_LOCK2_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK2_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK2_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK3
// Description : Software lock register for page 3.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK3_OFFSET _u(0x0000000c)
#define OTP_SW_LOCK3_BITS   _u(0x0000000f)
#define OTP_SW_LOCK3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK3_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK3_NSEC_RESET  "-"
#define OTP_SW_LOCK3_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK3_NSEC_MSB    _u(3)
#define OTP_SW_LOCK3_NSEC_LSB    _u(2)
#define OTP_SW_LOCK3_NSEC_ACCESS "RW"
#define OTP_SW_LOCK3_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK3_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK3_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK3_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK3_SEC_RESET  "-"
#define OTP_SW_LOCK3_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK3_SEC_MSB    _u(1)
#define OTP_SW_LOCK3_SEC_LSB    _u(0)
#define OTP_SW_LOCK3_SEC_ACCESS "RW"
#define OTP_SW_LOCK3_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK3_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK3_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK4
// Description : Software lock register for page 4.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK4_OFFSET _u(0x00000010)
#define OTP_SW_LOCK4_BITS   _u(0x0000000f)
#define OTP_SW_LOCK4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK4_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK4_NSEC_RESET  "-"
#define OTP_SW_LOCK4_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK4_NSEC_MSB    _u(3)
#define OTP_SW_LOCK4_NSEC_LSB    _u(2)
#define OTP_SW_LOCK4_NSEC_ACCESS "RW"
#define OTP_SW_LOCK4_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK4_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK4_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK4_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK4_SEC_RESET  "-"
#define OTP_SW_LOCK4_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK4_SEC_MSB    _u(1)
#define OTP_SW_LOCK4_SEC_LSB    _u(0)
#define OTP_SW_LOCK4_SEC_ACCESS "RW"
#define OTP_SW_LOCK4_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK4_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK4_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK5
// Description : Software lock register for page 5.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK5_OFFSET _u(0x00000014)
#define OTP_SW_LOCK5_BITS   _u(0x0000000f)
#define OTP_SW_LOCK5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK5_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK5_NSEC_RESET  "-"
#define OTP_SW_LOCK5_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK5_NSEC_MSB    _u(3)
#define OTP_SW_LOCK5_NSEC_LSB    _u(2)
#define OTP_SW_LOCK5_NSEC_ACCESS "RW"
#define OTP_SW_LOCK5_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK5_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK5_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK5_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK5_SEC_RESET  "-"
#define OTP_SW_LOCK5_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK5_SEC_MSB    _u(1)
#define OTP_SW_LOCK5_SEC_LSB    _u(0)
#define OTP_SW_LOCK5_SEC_ACCESS "RW"
#define OTP_SW_LOCK5_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK5_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK5_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK6
// Description : Software lock register for page 6.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK6_OFFSET _u(0x00000018)
#define OTP_SW_LOCK6_BITS   _u(0x0000000f)
#define OTP_SW_LOCK6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK6_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK6_NSEC_RESET  "-"
#define OTP_SW_LOCK6_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK6_NSEC_MSB    _u(3)
#define OTP_SW_LOCK6_NSEC_LSB    _u(2)
#define OTP_SW_LOCK6_NSEC_ACCESS "RW"
#define OTP_SW_LOCK6_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK6_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK6_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK6_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK6_SEC_RESET  "-"
#define OTP_SW_LOCK6_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK6_SEC_MSB    _u(1)
#define OTP_SW_LOCK6_SEC_LSB    _u(0)
#define OTP_SW_LOCK6_SEC_ACCESS "RW"
#define OTP_SW_LOCK6_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK6_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK6_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK7
// Description : Software lock register for page 7.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK7_OFFSET _u(0x0000001c)
#define OTP_SW_LOCK7_BITS   _u(0x0000000f)
#define OTP_SW_LOCK7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK7_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK7_NSEC_RESET  "-"
#define OTP_SW_LOCK7_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK7_NSEC_MSB    _u(3)
#define OTP_SW_LOCK7_NSEC_LSB    _u(2)
#define OTP_SW_LOCK7_NSEC_ACCESS "RW"
#define OTP_SW_LOCK7_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK7_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK7_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK7_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK7_SEC_RESET  "-"
#define OTP_SW_LOCK7_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK7_SEC_MSB    _u(1)
#define OTP_SW_LOCK7_SEC_LSB    _u(0)
#define OTP_SW_LOCK7_SEC_ACCESS "RW"
#define OTP_SW_LOCK7_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK7_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK7_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK8
// Description : Software lock register for page 8.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK8_OFFSET _u(0x00000020)
#define OTP_SW_LOCK8_BITS   _u(0x0000000f)
#define OTP_SW_LOCK8_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK8_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK8_NSEC_RESET  "-"
#define OTP_SW_LOCK8_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK8_NSEC_MSB    _u(3)
#define OTP_SW_LOCK8_NSEC_LSB    _u(2)
#define OTP_SW_LOCK8_NSEC_ACCESS "RW"
#define OTP_SW_LOCK8_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK8_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK8_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK8_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK8_SEC_RESET  "-"
#define OTP_SW_LOCK8_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK8_SEC_MSB    _u(1)
#define OTP_SW_LOCK8_SEC_LSB    _u(0)
#define OTP_SW_LOCK8_SEC_ACCESS "RW"
#define OTP_SW_LOCK8_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK8_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK8_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK9
// Description : Software lock register for page 9.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK9_OFFSET _u(0x00000024)
#define OTP_SW_LOCK9_BITS   _u(0x0000000f)
#define OTP_SW_LOCK9_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK9_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK9_NSEC_RESET  "-"
#define OTP_SW_LOCK9_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK9_NSEC_MSB    _u(3)
#define OTP_SW_LOCK9_NSEC_LSB    _u(2)
#define OTP_SW_LOCK9_NSEC_ACCESS "RW"
#define OTP_SW_LOCK9_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK9_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK9_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK9_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK9_SEC_RESET  "-"
#define OTP_SW_LOCK9_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK9_SEC_MSB    _u(1)
#define OTP_SW_LOCK9_SEC_LSB    _u(0)
#define OTP_SW_LOCK9_SEC_ACCESS "RW"
#define OTP_SW_LOCK9_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK9_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK9_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK10
// Description : Software lock register for page 10.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK10_OFFSET _u(0x00000028)
#define OTP_SW_LOCK10_BITS   _u(0x0000000f)
#define OTP_SW_LOCK10_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK10_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK10_NSEC_RESET  "-"
#define OTP_SW_LOCK10_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK10_NSEC_MSB    _u(3)
#define OTP_SW_LOCK10_NSEC_LSB    _u(2)
#define OTP_SW_LOCK10_NSEC_ACCESS "RW"
#define OTP_SW_LOCK10_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK10_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK10_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK10_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK10_SEC_RESET  "-"
#define OTP_SW_LOCK10_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK10_SEC_MSB    _u(1)
#define OTP_SW_LOCK10_SEC_LSB    _u(0)
#define OTP_SW_LOCK10_SEC_ACCESS "RW"
#define OTP_SW_LOCK10_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK10_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK10_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK11
// Description : Software lock register for page 11.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK11_OFFSET _u(0x0000002c)
#define OTP_SW_LOCK11_BITS   _u(0x0000000f)
#define OTP_SW_LOCK11_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK11_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK11_NSEC_RESET  "-"
#define OTP_SW_LOCK11_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK11_NSEC_MSB    _u(3)
#define OTP_SW_LOCK11_NSEC_LSB    _u(2)
#define OTP_SW_LOCK11_NSEC_ACCESS "RW"
#define OTP_SW_LOCK11_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK11_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK11_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK11_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK11_SEC_RESET  "-"
#define OTP_SW_LOCK11_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK11_SEC_MSB    _u(1)
#define OTP_SW_LOCK11_SEC_LSB    _u(0)
#define OTP_SW_LOCK11_SEC_ACCESS "RW"
#define OTP_SW_LOCK11_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK11_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK11_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK12
// Description : Software lock register for page 12.
//
//               Locks are initialised from the OTP lock pages at reset. This
