Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK12_OFFSET _u(0x00000030)
#define OTP_SW_LOCK12_BITS   _u(0x0000000f)
#define OTP_SW_LOCK12_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK12_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK12_NSEC_RESET  "-"
#define OTP_SW_LOCK12_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK12_NSEC_MSB    _u(3)
#define OTP_SW_LOCK12_NSEC_LSB    _u(2)
#define OTP_SW_LOCK12_NSEC_ACCESS "RW"
#define OTP_SW_LOCK12_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK12_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK12_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK12_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK12_SEC_RESET  "-"
#define OTP_SW_LOCK12_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK12_SEC_MSB    _u(1)
#define OTP_SW_LOCK12_SEC_LSB    _u(0)
#define OTP_SW_LOCK12_SEC_ACCESS "RW"
#define OTP_SW_LOCK12_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK12_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK12_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK13
// Description : Software lock register for page 13.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK13_OFFSET _u(0x00000034)
#define OTP_SW_LOCK13_BITS   _u(0x0000000f)
#define OTP_SW_LOCK13_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK13_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK13_NSEC_RESET  "-"
#define OTP_SW_LOCK13_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK13_NSEC_MSB    _u(3)
#define OTP_SW_LOCK13_NSEC_LSB    _u(2)
#define OTP_SW_LOCK13_NSEC_ACCESS "RW"
#define OTP_SW_LOCK13_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK13_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK13_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK13_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK13_SEC_RESET  "-"
#define OTP_SW_LOCK13_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK13_SEC_MSB    _u(1)
#define OTP_SW_LOCK13_SEC_LSB    _u(0)
#define OTP_SW_LOCK13_SEC_ACCESS "RW"
#define OTP_SW_LOCK13_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK13_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK13_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK14
// Description : Software lock register for page 14.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK14_OFFSET _u(0x00000038)
#define OTP_SW_LOCK14_BITS   _u(0x0000000f)
#define OTP_SW_LOCK14_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK14_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK14_NSEC_RESET  "-"
#define OTP_SW_LOCK14_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK14_NSEC_MSB    _u(3)
#define OTP_SW_LOCK14_NSEC_LSB    _u(2)
#define OTP_SW_LOCK14_NSEC_ACCESS "RW"
#define OTP_SW_LOCK14_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK14_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK14_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK14_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK14_SEC_RESET  "-"
#define OTP_SW_LOCK14_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK14_SEC_MSB    _u(1)
#define OTP_SW_LOCK14_SEC_LSB    _u(0)
#define OTP_SW_LOCK14_SEC_ACCESS "RW"
#define OTP_SW_LOCK14_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK14_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK14_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK15
// Description : Software lock register for page 15.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK15_OFFSET _u(0x0000003c)
#define OTP_SW_LOCK15_BITS   _u(0x0000000f)
#define OTP_SW_LOCK15_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK15_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK15_NSEC_RESET  "-"
#define OTP_SW_LOCK15_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK15_NSEC_MSB    _u(3)
#define OTP_SW_LOCK15_NSEC_LSB    _u(2)
#define OTP_SW_LOCK15_NSEC_ACCESS "RW"
#define OTP_SW_LOCK15_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK15_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK15_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK15_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK15_SEC_RESET  "-"
#define OTP_SW_LOCK15_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK15_SEC_MSB    _u(1)
#define OTP_SW_LOCK15_SEC_LSB    _u(0)
#define OTP_SW_LOCK15_SEC_ACCESS "RW"
#define OTP_SW_LOCK15_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK15_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK15_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK16
// Description : Software lock register for page 16.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK16_OFFSET _u(0x00000040)
#define OTP_SW_LOCK16_BITS   _u(0x0000000f)
#define OTP_SW_LOCK16_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK16_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK16_NSEC_RESET  "-"
#define OTP_SW_LOCK16_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK16_NSEC_MSB    _u(3)
#define OTP_SW_LOCK16_NSEC_LSB    _u(2)
#define OTP_SW_LOCK16_NSEC_ACCESS "RW"
#define OTP_SW_LOCK16_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK16_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK16_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK16_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK16_SEC_RESET  "-"
#define OTP_SW_LOCK16_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK16_SEC_MSB    _u(1)
#define OTP_SW_LOCK16_SEC_LSB    _u(0)
#define OTP_SW_LOCK16_SEC_ACCESS "RW"
#define OTP_SW_LOCK16_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK16_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK16_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK17
// Description : Software lock register for page 17.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK17_OFFSET _u(0x00000044)
#define OTP_SW_LOCK17_BITS   _u(0x0000000f)
#define OTP_SW_LOCK17_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK17_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK17_NSEC_RESET  "-"
#define OTP_SW_LOCK17_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK17_NSEC_MSB    _u(3)
#define OTP_SW_LOCK17_NSEC_LSB    _u(2)
#define OTP_SW_LOCK17_NSEC_ACCESS "RW"
#define OTP_SW_LOCK17_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK17_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK17_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK17_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK17_SEC_RESET  "-"
#define OTP_SW_LOCK17_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK17_SEC_MSB    _u(1)
#define OTP_SW_LOCK17_SEC_LSB    _u(0)
#define OTP_SW_LOCK17_SEC_ACCESS "RW"
#define OTP_SW_LOCK17_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK17_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK17_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK18
// Description : Software lock register for page 18.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK18_OFFSET _u(0x00000048)
#define OTP_SW_LOCK18_BITS   _u(0x0000000f)
#define OTP_SW_LOCK18_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK18_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK18_NSEC_RESET  "-"
#define OTP_SW_LOCK18_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK18_NSEC_MSB    _u(3)
#define OTP_SW_LOCK18_NSEC_LSB    _u(2)
#define OTP_SW_LOCK18_NSEC_ACCESS "RW"
#define OTP_SW_LOCK18_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK18_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK18_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK18_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK18_SEC_RESET  "-"
#define OTP_SW_LOCK18_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK18_SEC_MSB    _u(1)
#define OTP_SW_LOCK18_SEC_LSB    _u(0)
#define OTP_SW_LOCK18_SEC_ACCESS "RW"
#define OTP_SW_LOCK18_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK18_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK18_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK19
// Description : Software lock register for page 19.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK19_OFFSET _u(0x0000004c)
#define OTP_SW_LOCK19_BITS   _u(0x0000000f)
#define OTP_SW_LOCK19_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK19_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK19_NSEC_RESET  "-"
#define OTP_SW_LOCK19_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK19_NSEC_MSB    _u(3)
#define OTP_SW_LOCK19_NSEC_LSB    _u(2)
#define OTP_SW_LOCK19_NSEC_ACCESS "RW"
#define OTP_SW_LOCK19_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK19_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK19_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK19_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK19_SEC_RESET  "-"
#define OTP_SW_LOCK19_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK19_SEC_MSB    _u(1)
#define OTP_SW_LOCK19_SEC_LSB    _u(0)
#define OTP_SW_LOCK19_SEC_ACCESS "RW"
#define OTP_SW_LOCK19_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK19_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK19_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK20
// Description : Software lock register for page 20.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK20_OFFSET _u(0x00000050)
#define OTP_SW_LOCK20_BITS   _u(0x0000000f)
#define OTP_SW_LOCK20_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK20_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK20_NSEC_RESET  "-"
#define OTP_SW_LOCK20_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK20_NSEC_MSB    _u(3)
#define OTP_SW_LOCK20_NSEC_LSB    _u(2)
#define OTP_SW_LOCK20_NSEC_ACCESS "RW"
#define OTP_SW_LOCK20_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK20_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK20_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK20_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK20_SEC_RESET  "-"
#define OTP_SW_LOCK20_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK20_SEC_MSB    _u(1)
#define OTP_SW_LOCK20_SEC_LSB    _u(0)
#define OTP_SW_LOCK20_SEC_ACCESS "RW"
#define OTP_SW_LOCK20_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK20_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK20_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK21
// Description : Software lock register for page 21.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK21_OFFSET _u(0x00000054)
#define OTP_SW_LOCK21_BITS   _u(0x0000000f)
#define OTP_SW_LOCK21_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK21_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK21_NSEC_RESET  "-"
#define OTP_SW_LOCK21_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK21_NSEC_MSB    _u(3)
#define OTP_SW_LOCK21_NSEC_LSB    _u(2)
#define OTP_SW_LOCK21_NSEC_ACCESS "RW"
#define OTP_SW_LOCK21_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK21_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK21_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK21_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK21_SEC_RESET  "-"
#define OTP_SW_LOCK21_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK21_SEC_MSB    _u(1)
#define OTP_SW_LOCK21_SEC_LSB    _u(0)
#define OTP_SW_LOCK21_SEC_ACCESS "RW"
#define OTP_SW_LOCK21_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK21_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK21_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK22
// Description : Software lock register for page 22.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK22_OFFSET _u(0x00000058)
#define OTP_SW_LOCK22_BITS   _u(0x0000000f)
#define OTP_SW_LOCK22_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK22_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK22_NSEC_RESET  "-"
#define OTP_SW_LOCK22_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK22_NSEC_MSB    _u(3)
#define OTP_SW_LOCK22_NSEC_LSB    _u(2)
#define OTP_SW_LOCK22_NSEC_ACCESS "RW"
#define OTP_SW_LOCK22_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK22_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK22_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK22_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK22_SEC_RESET  "-"
#define OTP_SW_LOCK22_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK22_SEC_MSB    _u(1)
#define OTP_SW_LOCK22_SEC_LSB    _u(0)
#define OTP_SW_LOCK22_SEC_ACCESS "RW"
#define OTP_SW_LOCK22_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK22_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK22_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK23
// Description : Software lock register for page 23.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK23_OFFSET _u(0x0000005c)
#define OTP_SW_LOCK23_BITS   _u(0x0000000f)
#define OTP_SW_LOCK23_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK23_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK23_NSEC_RESET  "-"
#define OTP_SW_LOCK23_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK23_NSEC_MSB    _u(3)
#define OTP_SW_LOCK23_NSEC_LSB    _u(2)
#define OTP_SW_LOCK23_NSEC_ACCESS "RW"
#define OTP_SW_LOCK23_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK23_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK23_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK23_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK23_SEC_RESET  "-"
#define OTP_SW_LOCK23_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK23_SEC_MSB    _u(1)
#define OTP_SW_LOCK23_SEC_LSB    _u(0)
#define OTP_SW_LOCK23_SEC_ACCESS "RW"
#define OTP_SW_LOCK23_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK23_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK23_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK24
// Description : Software lock register for page 24.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK24_OFFSET _u(0x00000060)
#define OTP_SW_LOCK24_BITS   _u(0x0000000f)
#define OTP_SW_LOCK24_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK24_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
