Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK24_NSEC_RESET  "-"
#define OTP_SW_LOCK24_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK24_NSEC_MSB    _u(3)
#define OTP_SW_LOCK24_NSEC_LSB    _u(2)
#define OTP_SW_LOCK24_NSEC_ACCESS "RW"
#define OTP_SW_LOCK24_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK24_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK24_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK24_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK24_SEC_RESET  "-"
#define OTP_SW_LOCK24_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK24_SEC_MSB    _u(1)
#define OTP_SW_LOCK24_SEC_LSB    _u(0)
#define OTP_SW_LOCK24_SEC_ACCESS "RW"
#define OTP_SW_LOCK24_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK24_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK24_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK25
// Description : Software lock register for page 25.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK25_OFFSET _u(0x00000064)
#define OTP_SW_LOCK25_BITS   _u(0x0000000f)
#define OTP_SW_LOCK25_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK25_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK25_NSEC_RESET  "-"
#define OTP_SW_LOCK25_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK25_NSEC_MSB    _u(3)
#define OTP_SW_LOCK25_NSEC_LSB    _u(2)
#define OTP_SW_LOCK25_NSEC_ACCESS "RW"
#define OTP_SW_LOCK25_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK25_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK25_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK25_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK25_SEC_RESET  "-"
#define OTP_SW_LOCK25_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK25_SEC_MSB    _u(1)
#define OTP_SW_LOCK25_SEC_LSB    _u(0)
#define OTP_SW_LOCK25_SEC_ACCESS "RW"
#define OTP_SW_LOCK25_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK25_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK25_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK26
// Description : Software lock register for page 26.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK26_OFFSET _u(0x00000068)
#define OTP_SW_LOCK26_BITS   _u(0x0000000f)
#define OTP_SW_LOCK26_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK26_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK26_NSEC_RESET  "-"
#define OTP_SW_LOCK26_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK26_NSEC_MSB    _u(3)
#define OTP_SW_LOCK26_NSEC_LSB    _u(2)
#define OTP_SW_LOCK26_NSEC_ACCESS "RW"
#define OTP_SW_LOCK26_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK26_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK26_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK26_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK26_SEC_RESET  "-"
#define OTP_SW_LOCK26_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK26_SEC_MSB    _u(1)
#define OTP_SW_LOCK26_SEC_LSB    _u(0)
#define OTP_SW_LOCK26_SEC_ACCESS "RW"
#define OTP_SW_LOCK26_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK26_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK26_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK27
// Description : Software lock register for page 27.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK27_OFFSET _u(0x0000006c)
#define OTP_SW_LOCK27_BITS   _u(0x0000000f)
#define OTP_SW_LOCK27_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK27_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK27_NSEC_RESET  "-"
#define OTP_SW_LOCK27_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK27_NSEC_MSB    _u(3)
#define OTP_SW_LOCK27_NSEC_LSB    _u(2)
#define OTP_SW_LOCK27_NSEC_ACCESS "RW"
#define OTP_SW_LOCK27_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK27_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK27_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK27_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK27_SEC_RESET  "-"
#define OTP_SW_LOCK27_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK27_SEC_MSB    _u(1)
#define OTP_SW_LOCK27_SEC_LSB    _u(0)
#define OTP_SW_LOCK27_SEC_ACCESS "RW"
#define OTP_SW_LOCK27_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK27_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK27_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK28
// Description : Software lock register for page 28.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK28_OFFSET _u(0x00000070)
#define OTP_SW_LOCK28_BITS   _u(0x0000000f)
#define OTP_SW_LOCK28_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK28_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK28_NSEC_RESET  "-"
#define OTP_SW_LOCK28_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK28_NSEC_MSB    _u(3)
#define OTP_SW_LOCK28_NSEC_LSB    _u(2)
#define OTP_SW_LOCK28_NSEC_ACCESS "RW"
#define OTP_SW_LOCK28_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK28_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK28_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK28_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK28_SEC_RESET  "-"
#define OTP_SW_LOCK28_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK28_SEC_MSB    _u(1)
#define OTP_SW_LOCK28_SEC_LSB    _u(0)
#define OTP_SW_LOCK28_SEC_ACCESS "RW"
#define OTP_SW_LOCK28_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK28_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK28_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK29
// Description : Software lock register for page 29.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK29_OFFSET _u(0x00000074)
#define OTP_SW_LOCK29_BITS   _u(0x0000000f)
#define OTP_SW_LOCK29_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK29_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK29_NSEC_RESET  "-"
#define OTP_SW_LOCK29_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK29_NSEC_MSB    _u(3)
#define OTP_SW_LOCK29_NSEC_LSB    _u(2)
#define OTP_SW_LOCK29_NSEC_ACCESS "RW"
#define OTP_SW_LOCK29_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK29_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK29_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK29_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK29_SEC_RESET  "-"
#define OTP_SW_LOCK29_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK29_SEC_MSB    _u(1)
#define OTP_SW_LOCK29_SEC_LSB    _u(0)
#define OTP_SW_LOCK29_SEC_ACCESS "RW"
#define OTP_SW_LOCK29_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK29_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK29_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK30
// Description : Software lock register for page 30.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK30_OFFSET _u(0x00000078)
#define OTP_SW_LOCK30_BITS   _u(0x0000000f)
#define OTP_SW_LOCK30_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK30_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK30_NSEC_RESET  "-"
#define OTP_SW_LOCK30_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK30_NSEC_MSB    _u(3)
#define OTP_SW_LOCK30_NSEC_LSB    _u(2)
#define OTP_SW_LOCK30_NSEC_ACCESS "RW"
#define OTP_SW_LOCK30_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK30_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK30_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK30_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK30_SEC_RESET  "-"
#define OTP_SW_LOCK30_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK30_SEC_MSB    _u(1)
#define OTP_SW_LOCK30_SEC_LSB    _u(0)
#define OTP_SW_LOCK30_SEC_ACCESS "RW"
#define OTP_SW_LOCK30_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK30_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK30_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK31
// Description : Software lock register for page 31.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK31_OFFSET _u(0x0000007c)
#define OTP_SW_LOCK31_BITS   _u(0x0000000f)
#define OTP_SW_LOCK31_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK31_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK31_NSEC_RESET  "-"
#define OTP_SW_LOCK31_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK31_NSEC_MSB    _u(3)
#define OTP_SW_LOCK31_NSEC_LSB    _u(2)
#define OTP_SW_LOCK31_NSEC_ACCESS "RW"
#define OTP_SW_LOCK31_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK31_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK31_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK31_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK31_SEC_RESET  "-"
#define OTP_SW_LOCK31_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK31_SEC_MSB    _u(1)
#define OTP_SW_LOCK31_SEC_LSB    _u(0)
#define OTP_SW_LOCK31_SEC_ACCESS "RW"
#define OTP_SW_LOCK31_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK31_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK31_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK32
// Description : Software lock register for page 32.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK32_OFFSET _u(0x00000080)
#define OTP_SW_LOCK32_BITS   _u(0x0000000f)
#define OTP_SW_LOCK32_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK32_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK32_NSEC_RESET  "-"
#define OTP_SW_LOCK32_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK32_NSEC_MSB    _u(3)
#define OTP_SW_LOCK32_NSEC_LSB    _u(2)
#define OTP_SW_LOCK32_NSEC_ACCESS "RW"
#define OTP_SW_LOCK32_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK32_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK32_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK32_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK32_SEC_RESET  "-"
#define OTP_SW_LOCK32_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK32_SEC_MSB    _u(1)
#define OTP_SW_LOCK32_SEC_LSB    _u(0)
#define OTP_SW_LOCK32_SEC_ACCESS "RW"
#define OTP_SW_LOCK32_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK32_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK32_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK33
// Description : Software lock register for page 33.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK33_OFFSET _u(0x00000084)
#define OTP_SW_LOCK33_BITS   _u(0x0000000f)
#define OTP_SW_LOCK33_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK33_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK33_NSEC_RESET  "-"
#define OTP_SW_LOCK33_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK33_NSEC_MSB    _u(3)
#define OTP_SW_LOCK33_NSEC_LSB    _u(2)
#define OTP_SW_LOCK33_NSEC_ACCESS "RW"
#define OTP_SW_LOCK33_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK33_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK33_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK33_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK33_SEC_RESET  "-"
#define OTP_SW_LOCK33_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK33_SEC_MSB    _u(1)
#define OTP_SW_LOCK33_SEC_LSB    _u(0)
#define OTP_SW_LOCK33_SEC_ACCESS "RW"
#define OTP_SW_LOCK33_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK33_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK33_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK34
// Description : Software lock register for page 34.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK34_OFFSET _u(0x00000088)
#define OTP_SW_LOCK34_BITS   _u(0x0000000f)
#define OTP_SW_LOCK34_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK34_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK34_NSEC_RESET  "-"
#define OTP_SW_LOCK34_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK34_NSEC_MSB    _u(3)
#define OTP_SW_LOCK34_NSEC_LSB    _u(2)
#define OTP_SW_LOCK34_NSEC_ACCESS "RW"
#define OTP_SW_LOCK34_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK34_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK34_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK34_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK34_SEC_RESET  "-"
#define OTP_SW_LOCK34_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK34_SEC_MSB    _u(1)
#define OTP_SW_LOCK34_SEC_LSB    _u(0)
#define OTP_SW_LOCK34_SEC_ACCESS "RW"
#define OTP_SW_LOCK34_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK34_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK34_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK35
// Description : Software lock register for page 35.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK35_OFFSET _u(0x0000008c)
#define OTP_SW_LOCK35_BITS   _u(0x0000000f)
#define OTP_SW_LOCK35_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK35_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK35_NSEC_RESET  "-"
#define OTP_SW_LOCK35_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK35_NSEC_MSB    _u(3)
#define OTP_SW_LOCK35_NSEC_LSB    _u(2)
#define OTP_SW_LOCK35_NSEC_ACCESS "RW"
#define OTP_SW_LOCK35_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK35_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK35_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK35_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK35_SEC_RESET  "-"
#define OTP_SW_LOCK35_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK35_SEC_MSB    _u(1)
#define OTP_SW_LOCK35_SEC_LSB    _u(0)
#define OTP_SW_LOCK35_SEC_ACCESS "RW"
#define OTP_SW_LOCK35_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK35_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK35_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK36
// Description : Software lock register for page 36.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK36_OFFSET _u(0x00000090)
#define OTP_SW_LOCK36_BITS   _u(0x0000000f)
#define OTP_SW_LOCK36_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK36_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK36_NSEC_RESET  "-"
#define OTP_SW_LOCK36_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK36_NSEC_MSB    _u(3)
#define OTP_SW_LOCK36_NSEC_LSB    _u(2)
#define OTP_SW_LOCK36_NSEC_ACCESS "RW"
#define OTP_SW_LOCK36_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK36_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK36_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
