Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
// Field       : OTP_SW_LOCK36_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK36_SEC_RESET  "-"
#define OTP_SW_LOCK36_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK36_SEC_MSB    _u(1)
#define OTP_SW_LOCK36_SEC_LSB    _u(0)
#define OTP_SW_LOCK36_SEC_ACCESS "RW"
#define OTP_SW_LOCK36_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK36_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK36_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK37
// Description : Software lock register for page 37.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK37_OFFSET _u(0x00000094)
#define OTP_SW_LOCK37_BITS   _u(0x0000000f)
#define OTP_SW_LOCK37_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK37_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK37_NSEC_RESET  "-"
#define OTP_SW_LOCK37_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK37_NSEC_MSB    _u(3)
#define OTP_SW_LOCK37_NSEC_LSB    _u(2)
#define OTP_SW_LOCK37_NSEC_ACCESS "RW"
#define OTP_SW_LOCK37_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK37_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK37_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK37_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK37_SEC_RESET  "-"
#define OTP_SW_LOCK37_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK37_SEC_MSB    _u(1)
#define OTP_SW_LOCK37_SEC_LSB    _u(0)
#define OTP_SW_LOCK37_SEC_ACCESS "RW"
#define OTP_SW_LOCK37_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK37_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK37_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK38
// Description : Software lock register for page 38.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK38_OFFSET _u(0x00000098)
#define OTP_SW_LOCK38_BITS   _u(0x0000000f)
#define OTP_SW_LOCK38_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK38_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK38_NSEC_RESET  "-"
#define OTP_SW_LOCK38_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK38_NSEC_MSB    _u(3)
#define OTP_SW_LOCK38_NSEC_LSB    _u(2)
#define OTP_SW_LOCK38_NSEC_ACCESS "RW"
#define OTP_SW_LOCK38_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK38_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK38_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK38_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK38_SEC_RESET  "-"
#define OTP_SW_LOCK38_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK38_SEC_MSB    _u(1)
#define OTP_SW_LOCK38_SEC_LSB    _u(0)
#define OTP_SW_LOCK38_SEC_ACCESS "RW"
#define OTP_SW_LOCK38_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK38_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK38_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK39
// Description : Software lock register for page 39.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK39_OFFSET _u(0x0000009c)
#define OTP_SW_LOCK39_BITS   _u(0x0000000f)
#define OTP_SW_LOCK39_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK39_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK39_NSEC_RESET  "-"
#define OTP_SW_LOCK39_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK39_NSEC_MSB    _u(3)
#define OTP_SW_LOCK39_NSEC_LSB    _u(2)
#define OTP_SW_LOCK39_NSEC_ACCESS "RW"
#define OTP_SW_LOCK39_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK39_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK39_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK39_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK39_SEC_RESET  "-"
#define OTP_SW_LOCK39_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK39_SEC_MSB    _u(1)
#define OTP_SW_LOCK39_SEC_LSB    _u(0)
#define OTP_SW_LOCK39_SEC_ACCESS "RW"
#define OTP_SW_LOCK39_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK39_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK39_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK40
// Description : Software lock register for page 40.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK40_OFFSET _u(0x000000a0)
#define OTP_SW_LOCK40_BITS   _u(0x0000000f)
#define OTP_SW_LOCK40_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK40_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK40_NSEC_RESET  "-"
#define OTP_SW_LOCK40_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK40_NSEC_MSB    _u(3)
#define OTP_SW_LOCK40_NSEC_LSB    _u(2)
#define OTP_SW_LOCK40_NSEC_ACCESS "RW"
#define OTP_SW_LOCK40_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK40_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK40_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK40_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK40_SEC_RESET  "-"
#define OTP_SW_LOCK40_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK40_SEC_MSB    _u(1)
#define OTP_SW_LOCK40_SEC_LSB    _u(0)
#define OTP_SW_LOCK40_SEC_ACCESS "RW"
#define OTP_SW_LOCK40_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK40_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK40_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK41
// Description : Software lock register for page 41.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK41_OFFSET _u(0x000000a4)
#define OTP_SW_LOCK41_BITS   _u(0x0000000f)
#define OTP_SW_LOCK41_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK41_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK41_NSEC_RESET  "-"
#define OTP_SW_LOCK41_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK41_NSEC_MSB    _u(3)
#define OTP_SW_LOCK41_NSEC_LSB    _u(2)
#define OTP_SW_LOCK41_NSEC_ACCESS "RW"
#define OTP_SW_LOCK41_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK41_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK41_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK41_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK41_SEC_RESET  "-"
#define OTP_SW_LOCK41_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK41_SEC_MSB    _u(1)
#define OTP_SW_LOCK41_SEC_LSB    _u(0)
#define OTP_SW_LOCK41_SEC_ACCESS "RW"
#define OTP_SW_LOCK41_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK41_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK41_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK42
// Description : Software lock register for page 42.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK42_OFFSET _u(0x000000a8)
#define OTP_SW_LOCK42_BITS   _u(0x0000000f)
#define OTP_SW_LOCK42_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK42_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK42_NSEC_RESET  "-"
#define OTP_SW_LOCK42_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK42_NSEC_MSB    _u(3)
#define OTP_SW_LOCK42_NSEC_LSB    _u(2)
#define OTP_SW_LOCK42_NSEC_ACCESS "RW"
#define OTP_SW_LOCK42_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK42_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK42_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK42_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK42_SEC_RESET  "-"
#define OTP_SW_LOCK42_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK42_SEC_MSB    _u(1)
#define OTP_SW_LOCK42_SEC_LSB    _u(0)
#define OTP_SW_LOCK42_SEC_ACCESS "RW"
#define OTP_SW_LOCK42_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK42_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK42_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK43
// Description : Software lock register for page 43.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK43_OFFSET _u(0x000000ac)
#define OTP_SW_LOCK43_BITS   _u(0x0000000f)
#define OTP_SW_LOCK43_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK43_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK43_NSEC_RESET  "-"
#define OTP_SW_LOCK43_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK43_NSEC_MSB    _u(3)
#define OTP_SW_LOCK43_NSEC_LSB    _u(2)
#define OTP_SW_LOCK43_NSEC_ACCESS "RW"
#define OTP_SW_LOCK43_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK43_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK43_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK43_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK43_SEC_RESET  "-"
#define OTP_SW_LOCK43_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK43_SEC_MSB    _u(1)
#define OTP_SW_LOCK43_SEC_LSB    _u(0)
#define OTP_SW_LOCK43_SEC_ACCESS "RW"
#define OTP_SW_LOCK43_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK43_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK43_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK44
// Description : Software lock register for page 44.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK44_OFFSET _u(0x000000b0)
#define OTP_SW_LOCK44_BITS   _u(0x0000000f)
#define OTP_SW_LOCK44_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK44_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK44_NSEC_RESET  "-"
#define OTP_SW_LOCK44_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK44_NSEC_MSB    _u(3)
#define OTP_SW_LOCK44_NSEC_LSB    _u(2)
#define OTP_SW_LOCK44_NSEC_ACCESS "RW"
#define OTP_SW_LOCK44_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK44_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK44_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK44_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK44_SEC_RESET  "-"
#define OTP_SW_LOCK44_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK44_SEC_MSB    _u(1)
#define OTP_SW_LOCK44_SEC_LSB    _u(0)
#define OTP_SW_LOCK44_SEC_ACCESS "RW"
#define OTP_SW_LOCK44_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK44_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK44_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK45
// Description : Software lock register for page 45.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK45_OFFSET _u(0x000000b4)
#define OTP_SW_LOCK45_BITS   _u(0x0000000f)
#define OTP_SW_LOCK45_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK45_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK45_NSEC_RESET  "-"
#define OTP_SW_LOCK45_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK45_NSEC_MSB    _u(3)
#define OTP_SW_LOCK45_NSEC_LSB    _u(2)
#define OTP_SW_LOCK45_NSEC_ACCESS "RW"
#define OTP_SW_LOCK45_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK45_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK45_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK45_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK45_SEC_RESET  "-"
#define OTP_SW_LOCK45_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK45_SEC_MSB    _u(1)
#define OTP_SW_LOCK45_SEC_LSB    _u(0)
#define OTP_SW_LOCK45_SEC_ACCESS "RW"
#define OTP_SW_LOCK45_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK45_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK45_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK46
// Description : Software lock register for page 46.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK46_OFFSET _u(0x000000b8)
#define OTP_SW_LOCK46_BITS   _u(0x0000000f)
#define OTP_SW_LOCK46_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK46_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK46_NSEC_RESET  "-"
#define OTP_SW_LOCK46_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK46_NSEC_MSB    _u(3)
#define OTP_SW_LOCK46_NSEC_LSB    _u(2)
#define OTP_SW_LOCK46_NSEC_ACCESS "RW"
#define OTP_SW_LOCK46_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK46_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK46_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK46_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK46_SEC_RESET  "-"
#define OTP_SW_LOCK46_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK46_SEC_MSB    _u(1)
#define OTP_SW_LOCK46_SEC_LSB    _u(0)
#define OTP_SW_LOCK46_SEC_ACCESS "RW"
#define OTP_SW_LOCK46_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK46_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK46_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK47
// Description : Software lock register for page 47.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK47_OFFSET _u(0x000000bc)
#define OTP_SW_LOCK47_BITS   _u(0x0000000f)
#define OTP_SW_LOCK47_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK47_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK47_NSEC_RESET  "-"
#define OTP_SW_LOCK47_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK47_NSEC_MSB    _u(3)
#define OTP_SW_LOCK47_NSEC_LSB    _u(2)
#define OTP_SW_LOCK47_NSEC_ACCESS "RW"
#define OTP_SW_LOCK47_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK47_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK47_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK47_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK47_SEC_RESET  "-"
#define OTP_SW_LOCK47_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK47_SEC_MSB    _u(1)
#define OTP_SW_LOCK47_SEC_LSB    _u(0)
#define OTP_SW_LOCK47_SEC_ACCESS "RW"
#define OTP_SW_LOCK47_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK47_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK47_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK48
// Description : Software lock register for page 48.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK48_OFFSET _u(0x000000c0)
#define OTP_SW_LOCK48_BITS   _u(0x0000000f)
#define OTP_SW_LOCK48_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK48_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK48_NSEC_RESET  "-"
#define OTP_SW_LOCK48_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK48_NSEC_MSB    _u(3)
#define OTP_SW_LOCK48_NSEC_LSB    _u(2)
#define OTP_SW_LOCK48_NSEC_ACCESS "RW"
#define OTP_SW_LOCK48_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK48_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK48_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK48_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK48_SEC_RESET  "-"
#define OTP_SW_LOCK48_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK48_SEC_MSB    _u(1)
#define OTP_SW_LOCK48_SEC_LSB    _u(0)
#define OTP_SW_LOCK48_SEC_ACCESS "RW"
#define OTP_SW_LOCK48_SEC_VALUE_READ_WRITE _u(0x0)
