Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
#define OTP_SW_LOCK48_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK48_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK49
// Description : Software lock register for page 49.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK49_OFFSET _u(0x000000c4)
#define OTP_SW_LOCK49_BITS   _u(0x0000000f)
#define OTP_SW_LOCK49_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK49_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK49_NSEC_RESET  "-"
#define OTP_SW_LOCK49_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK49_NSEC_MSB    _u(3)
#define OTP_SW_LOCK49_NSEC_LSB    _u(2)
#define OTP_SW_LOCK49_NSEC_ACCESS "RW"
#define OTP_SW_LOCK49_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK49_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK49_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK49_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK49_SEC_RESET  "-"
#define OTP_SW_LOCK49_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK49_SEC_MSB    _u(1)
#define OTP_SW_LOCK49_SEC_LSB    _u(0)
#define OTP_SW_LOCK49_SEC_ACCESS "RW"
#define OTP_SW_LOCK49_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK49_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK49_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK50
// Description : Software lock register for page 50.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK50_OFFSET _u(0x000000c8)
#define OTP_SW_LOCK50_BITS   _u(0x0000000f)
#define OTP_SW_LOCK50_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK50_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK50_NSEC_RESET  "-"
#define OTP_SW_LOCK50_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK50_NSEC_MSB    _u(3)
#define OTP_SW_LOCK50_NSEC_LSB    _u(2)
#define OTP_SW_LOCK50_NSEC_ACCESS "RW"
#define OTP_SW_LOCK50_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK50_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK50_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK50_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK50_SEC_RESET  "-"
#define OTP_SW_LOCK50_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK50_SEC_MSB    _u(1)
#define OTP_SW_LOCK50_SEC_LSB    _u(0)
#define OTP_SW_LOCK50_SEC_ACCESS "RW"
#define OTP_SW_LOCK50_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK50_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK50_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK51
// Description : Software lock register for page 51.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK51_OFFSET _u(0x000000cc)
#define OTP_SW_LOCK51_BITS   _u(0x0000000f)
#define OTP_SW_LOCK51_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK51_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK51_NSEC_RESET  "-"
#define OTP_SW_LOCK51_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK51_NSEC_MSB    _u(3)
#define OTP_SW_LOCK51_NSEC_LSB    _u(2)
#define OTP_SW_LOCK51_NSEC_ACCESS "RW"
#define OTP_SW_LOCK51_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK51_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK51_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK51_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK51_SEC_RESET  "-"
#define OTP_SW_LOCK51_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK51_SEC_MSB    _u(1)
#define OTP_SW_LOCK51_SEC_LSB    _u(0)
#define OTP_SW_LOCK51_SEC_ACCESS "RW"
#define OTP_SW_LOCK51_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK51_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK51_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK52
// Description : Software lock register for page 52.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK52_OFFSET _u(0x000000d0)
#define OTP_SW_LOCK52_BITS   _u(0x0000000f)
#define OTP_SW_LOCK52_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK52_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK52_NSEC_RESET  "-"
#define OTP_SW_LOCK52_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK52_NSEC_MSB    _u(3)
#define OTP_SW_LOCK52_NSEC_LSB    _u(2)
#define OTP_SW_LOCK52_NSEC_ACCESS "RW"
#define OTP_SW_LOCK52_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK52_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK52_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK52_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK52_SEC_RESET  "-"
#define OTP_SW_LOCK52_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK52_SEC_MSB    _u(1)
#define OTP_SW_LOCK52_SEC_LSB    _u(0)
#define OTP_SW_LOCK52_SEC_ACCESS "RW"
#define OTP_SW_LOCK52_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK52_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK52_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK53
// Description : Software lock register for page 53.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK53_OFFSET _u(0x000000d4)
#define OTP_SW_LOCK53_BITS   _u(0x0000000f)
#define OTP_SW_LOCK53_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK53_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK53_NSEC_RESET  "-"
#define OTP_SW_LOCK53_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK53_NSEC_MSB    _u(3)
#define OTP_SW_LOCK53_NSEC_LSB    _u(2)
#define OTP_SW_LOCK53_NSEC_ACCESS "RW"
#define OTP_SW_LOCK53_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK53_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK53_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK53_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK53_SEC_RESET  "-"
#define OTP_SW_LOCK53_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK53_SEC_MSB    _u(1)
#define OTP_SW_LOCK53_SEC_LSB    _u(0)
#define OTP_SW_LOCK53_SEC_ACCESS "RW"
#define OTP_SW_LOCK53_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK53_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK53_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK54
// Description : Software lock register for page 54.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK54_OFFSET _u(0x000000d8)
#define OTP_SW_LOCK54_BITS   _u(0x0000000f)
#define OTP_SW_LOCK54_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK54_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK54_NSEC_RESET  "-"
#define OTP_SW_LOCK54_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK54_NSEC_MSB    _u(3)
#define OTP_SW_LOCK54_NSEC_LSB    _u(2)
#define OTP_SW_LOCK54_NSEC_ACCESS "RW"
#define OTP_SW_LOCK54_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK54_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK54_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK54_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK54_SEC_RESET  "-"
#define OTP_SW_LOCK54_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK54_SEC_MSB    _u(1)
#define OTP_SW_LOCK54_SEC_LSB    _u(0)
#define OTP_SW_LOCK54_SEC_ACCESS "RW"
#define OTP_SW_LOCK54_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK54_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK54_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK55
// Description : Software lock register for page 55.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK55_OFFSET _u(0x000000dc)
#define OTP_SW_LOCK55_BITS   _u(0x0000000f)
#define OTP_SW_LOCK55_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK55_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK55_NSEC_RESET  "-"
#define OTP_SW_LOCK55_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK55_NSEC_MSB    _u(3)
#define OTP_SW_LOCK55_NSEC_LSB    _u(2)
#define OTP_SW_LOCK55_NSEC_ACCESS "RW"
#define OTP_SW_LOCK55_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK55_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK55_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK55_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK55_SEC_RESET  "-"
#define OTP_SW_LOCK55_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK55_SEC_MSB    _u(1)
#define OTP_SW_LOCK55_SEC_LSB    _u(0)
#define OTP_SW_LOCK55_SEC_ACCESS "RW"
#define OTP_SW_LOCK55_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK55_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK55_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK56
// Description : Software lock register for page 56.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK56_OFFSET _u(0x000000e0)
#define OTP_SW_LOCK56_BITS   _u(0x0000000f)
#define OTP_SW_LOCK56_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK56_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK56_NSEC_RESET  "-"
#define OTP_SW_LOCK56_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK56_NSEC_MSB    _u(3)
#define OTP_SW_LOCK56_NSEC_LSB    _u(2)
#define OTP_SW_LOCK56_NSEC_ACCESS "RW"
#define OTP_SW_LOCK56_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK56_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK56_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK56_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK56_SEC_RESET  "-"
#define OTP_SW_LOCK56_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK56_SEC_MSB    _u(1)
#define OTP_SW_LOCK56_SEC_LSB    _u(0)
#define OTP_SW_LOCK56_SEC_ACCESS "RW"
#define OTP_SW_LOCK56_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK56_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK56_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK57
// Description : Software lock register for page 57.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK57_OFFSET _u(0x000000e4)
#define OTP_SW_LOCK57_BITS   _u(0x0000000f)
#define OTP_SW_LOCK57_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK57_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK57_NSEC_RESET  "-"
#define OTP_SW_LOCK57_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK57_NSEC_MSB    _u(3)
#define OTP_SW_LOCK57_NSEC_LSB    _u(2)
#define OTP_SW_LOCK57_NSEC_ACCESS "RW"
#define OTP_SW_LOCK57_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK57_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK57_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK57_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK57_SEC_RESET  "-"
#define OTP_SW_LOCK57_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK57_SEC_MSB    _u(1)
#define OTP_SW_LOCK57_SEC_LSB    _u(0)
#define OTP_SW_LOCK57_SEC_ACCESS "RW"
#define OTP_SW_LOCK57_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK57_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK57_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK58
// Description : Software lock register for page 58.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK58_OFFSET _u(0x000000e8)
#define OTP_SW_LOCK58_BITS   _u(0x0000000f)
#define OTP_SW_LOCK58_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK58_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK58_NSEC_RESET  "-"
#define OTP_SW_LOCK58_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK58_NSEC_MSB    _u(3)
#define OTP_SW_LOCK58_NSEC_LSB    _u(2)
#define OTP_SW_LOCK58_NSEC_ACCESS "RW"
#define OTP_SW_LOCK58_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK58_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK58_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK58_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK58_SEC_RESET  "-"
#define OTP_SW_LOCK58_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK58_SEC_MSB    _u(1)
#define OTP_SW_LOCK58_SEC_LSB    _u(0)
#define OTP_SW_LOCK58_SEC_ACCESS "RW"
#define OTP_SW_LOCK58_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK58_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK58_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK59
// Description : Software lock register for page 59.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK59_OFFSET _u(0x000000ec)
#define OTP_SW_LOCK59_BITS   _u(0x0000000f)
#define OTP_SW_LOCK59_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK59_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK59_NSEC_RESET  "-"
#define OTP_SW_LOCK59_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK59_NSEC_MSB    _u(3)
#define OTP_SW_LOCK59_NSEC_LSB    _u(2)
#define OTP_SW_LOCK59_NSEC_ACCESS "RW"
#define OTP_SW_LOCK59_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK59_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK59_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK59_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK59_SEC_RESET  "-"
#define OTP_SW_LOCK59_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK59_SEC_MSB    _u(1)
#define OTP_SW_LOCK59_SEC_LSB    _u(0)
#define OTP_SW_LOCK59_SEC_ACCESS "RW"
#define OTP_SW_LOCK59_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK59_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK59_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK60
// Description : Software lock register for page 60.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK60_OFFSET _u(0x000000f0)
#define OTP_SW_LOCK60_BITS   _u(0x0000000f)
#define OTP_SW_LOCK60_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK60_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK60_NSEC_RESET  "-"
#define OTP_SW_LOCK60_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK60_NSEC_MSB    _u(3)
#define OTP_SW_LOCK60_NSEC_LSB    _u(2)
#define OTP_SW_LOCK60_NSEC_ACCESS "RW"
#define OTP_SW_LOCK60_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK60_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK60_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK60_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK60_SEC_RESET  "-"
#define OTP_SW_LOCK60_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK60_SEC_MSB    _u(1)
#define OTP_SW_LOCK60_SEC_LSB    _u(0)
#define OTP_SW_LOCK60_SEC_ACCESS "RW"
#define OTP_SW_LOCK60_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK60_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK60_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK61
// Description : Software lock register for page 61.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
