Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
#define OTP_SW_LOCK61_OFFSET _u(0x000000f4)
#define OTP_SW_LOCK61_BITS   _u(0x0000000f)
#define OTP_SW_LOCK61_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK61_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK61_NSEC_RESET  "-"
#define OTP_SW_LOCK61_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK61_NSEC_MSB    _u(3)
#define OTP_SW_LOCK61_NSEC_LSB    _u(2)
#define OTP_SW_LOCK61_NSEC_ACCESS "RW"
#define OTP_SW_LOCK61_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK61_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK61_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK61_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK61_SEC_RESET  "-"
#define OTP_SW_LOCK61_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK61_SEC_MSB    _u(1)
#define OTP_SW_LOCK61_SEC_LSB    _u(0)
#define OTP_SW_LOCK61_SEC_ACCESS "RW"
#define OTP_SW_LOCK61_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK61_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK61_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK62
// Description : Software lock register for page 62.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK62_OFFSET _u(0x000000f8)
#define OTP_SW_LOCK62_BITS   _u(0x0000000f)
#define OTP_SW_LOCK62_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK62_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK62_NSEC_RESET  "-"
#define OTP_SW_LOCK62_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK62_NSEC_MSB    _u(3)
#define OTP_SW_LOCK62_NSEC_LSB    _u(2)
#define OTP_SW_LOCK62_NSEC_ACCESS "RW"
#define OTP_SW_LOCK62_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK62_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK62_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK62_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK62_SEC_RESET  "-"
#define OTP_SW_LOCK62_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK62_SEC_MSB    _u(1)
#define OTP_SW_LOCK62_SEC_LSB    _u(0)
#define OTP_SW_LOCK62_SEC_ACCESS "RW"
#define OTP_SW_LOCK62_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK62_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK62_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SW_LOCK63
// Description : Software lock register for page 63.
//
//               Locks are initialised from the OTP lock pages at reset. This
//               register can be written to further advance the lock state of
//               each page (until next reset), and read to check the current
//               lock state of a page.
#define OTP_SW_LOCK63_OFFSET _u(0x000000fc)
#define OTP_SW_LOCK63_BITS   _u(0x0000000f)
#define OTP_SW_LOCK63_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK63_NSEC
// Description : Non-secure lock status. Writes are OR'd with the current value.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK63_NSEC_RESET  "-"
#define OTP_SW_LOCK63_NSEC_BITS   _u(0x0000000c)
#define OTP_SW_LOCK63_NSEC_MSB    _u(3)
#define OTP_SW_LOCK63_NSEC_LSB    _u(2)
#define OTP_SW_LOCK63_NSEC_ACCESS "RW"
#define OTP_SW_LOCK63_NSEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK63_NSEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK63_NSEC_VALUE_INACCESSIBLE _u(0x3)
// -----------------------------------------------------------------------------
// Field       : OTP_SW_LOCK63_SEC
// Description : Secure lock status. Writes are OR'd with the current value.
//               This field is read-only to Non-secure code.
//               0x0 -> read_write
//               0x1 -> read_only
//               0x3 -> inaccessible
#define OTP_SW_LOCK63_SEC_RESET  "-"
#define OTP_SW_LOCK63_SEC_BITS   _u(0x00000003)
#define OTP_SW_LOCK63_SEC_MSB    _u(1)
#define OTP_SW_LOCK63_SEC_LSB    _u(0)
#define OTP_SW_LOCK63_SEC_ACCESS "RW"
#define OTP_SW_LOCK63_SEC_VALUE_READ_WRITE _u(0x0)
#define OTP_SW_LOCK63_SEC_VALUE_READ_ONLY _u(0x1)
#define OTP_SW_LOCK63_SEC_VALUE_INACCESSIBLE _u(0x3)
// =============================================================================
// Register    : OTP_SBPI_INSTR
// Description : Dispatch instructions to the SBPI interface, used for
//               programming the OTP fuses.
#define OTP_SBPI_INSTR_OFFSET _u(0x00000100)
#define OTP_SBPI_INSTR_BITS   _u(0x7fffffff)
#define OTP_SBPI_INSTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_EXEC
// Description : Execute instruction
#define OTP_SBPI_INSTR_EXEC_RESET  _u(0x0)
#define OTP_SBPI_INSTR_EXEC_BITS   _u(0x40000000)
#define OTP_SBPI_INSTR_EXEC_MSB    _u(30)
#define OTP_SBPI_INSTR_EXEC_LSB    _u(30)
#define OTP_SBPI_INSTR_EXEC_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_IS_WR
// Description : Payload type is write
#define OTP_SBPI_INSTR_IS_WR_RESET  _u(0x0)
#define OTP_SBPI_INSTR_IS_WR_BITS   _u(0x20000000)
#define OTP_SBPI_INSTR_IS_WR_MSB    _u(29)
#define OTP_SBPI_INSTR_IS_WR_LSB    _u(29)
#define OTP_SBPI_INSTR_IS_WR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_HAS_PAYLOAD
// Description : Instruction has payload (data to be written or to be read)
#define OTP_SBPI_INSTR_HAS_PAYLOAD_RESET  _u(0x0)
#define OTP_SBPI_INSTR_HAS_PAYLOAD_BITS   _u(0x10000000)
#define OTP_SBPI_INSTR_HAS_PAYLOAD_MSB    _u(28)
#define OTP_SBPI_INSTR_HAS_PAYLOAD_LSB    _u(28)
#define OTP_SBPI_INSTR_HAS_PAYLOAD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_PAYLOAD_SIZE_M1
// Description : Instruction payload size in bytes minus 1
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_RESET  _u(0x0)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_BITS   _u(0x0f000000)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_MSB    _u(27)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_LSB    _u(24)
#define OTP_SBPI_INSTR_PAYLOAD_SIZE_M1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_TARGET
// Description : Instruction target, it can be PMC (0x3a) or DAP (0x02)
#define OTP_SBPI_INSTR_TARGET_RESET  _u(0x00)
#define OTP_SBPI_INSTR_TARGET_BITS   _u(0x00ff0000)
#define OTP_SBPI_INSTR_TARGET_MSB    _u(23)
#define OTP_SBPI_INSTR_TARGET_LSB    _u(16)
#define OTP_SBPI_INSTR_TARGET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_CMD
#define OTP_SBPI_INSTR_CMD_RESET  _u(0x00)
#define OTP_SBPI_INSTR_CMD_BITS   _u(0x0000ff00)
#define OTP_SBPI_INSTR_CMD_MSB    _u(15)
#define OTP_SBPI_INSTR_CMD_LSB    _u(8)
#define OTP_SBPI_INSTR_CMD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_INSTR_SHORT_WDATA
// Description : wdata to be used only when payload_size_m1=0
#define OTP_SBPI_INSTR_SHORT_WDATA_RESET  _u(0x00)
#define OTP_SBPI_INSTR_SHORT_WDATA_BITS   _u(0x000000ff)
#define OTP_SBPI_INSTR_SHORT_WDATA_MSB    _u(7)
#define OTP_SBPI_INSTR_SHORT_WDATA_LSB    _u(0)
#define OTP_SBPI_INSTR_SHORT_WDATA_ACCESS "RW"
// =============================================================================
// Register    : OTP_SBPI_WDATA_0
// Description : SBPI write payload bytes 3..0
#define OTP_SBPI_WDATA_0_OFFSET _u(0x00000104)
#define OTP_SBPI_WDATA_0_BITS   _u(0xffffffff)
#define OTP_SBPI_WDATA_0_RESET  _u(0x00000000)
#define OTP_SBPI_WDATA_0_MSB    _u(31)
#define OTP_SBPI_WDATA_0_LSB    _u(0)
#define OTP_SBPI_WDATA_0_ACCESS "RW"
// =============================================================================
// Register    : OTP_SBPI_WDATA_1
// Description : SBPI write payload bytes 7..4
#define OTP_SBPI_WDATA_1_OFFSET _u(0x00000108)
#define OTP_SBPI_WDATA_1_BITS   _u(0xffffffff)
#define OTP_SBPI_WDATA_1_RESET  _u(0x00000000)
#define OTP_SBPI_WDATA_1_MSB    _u(31)
#define OTP_SBPI_WDATA_1_LSB    _u(0)
#define OTP_SBPI_WDATA_1_ACCESS "RW"
// =============================================================================
// Register    : OTP_SBPI_WDATA_2
// Description : SBPI write payload bytes 11..8
#define OTP_SBPI_WDATA_2_OFFSET _u(0x0000010c)
#define OTP_SBPI_WDATA_2_BITS   _u(0xffffffff)
#define OTP_SBPI_WDATA_2_RESET  _u(0x00000000)
#define OTP_SBPI_WDATA_2_MSB    _u(31)
#define OTP_SBPI_WDATA_2_LSB    _u(0)
#define OTP_SBPI_WDATA_2_ACCESS "RW"
// =============================================================================
// Register    : OTP_SBPI_WDATA_3
// Description : SBPI write payload bytes 15..12
#define OTP_SBPI_WDATA_3_OFFSET _u(0x00000110)
#define OTP_SBPI_WDATA_3_BITS   _u(0xffffffff)
#define OTP_SBPI_WDATA_3_RESET  _u(0x00000000)
#define OTP_SBPI_WDATA_3_MSB    _u(31)
#define OTP_SBPI_WDATA_3_LSB    _u(0)
#define OTP_SBPI_WDATA_3_ACCESS "RW"
// =============================================================================
// Register    : OTP_SBPI_RDATA_0
// Description : Read payload bytes 3..0. Once read, the data in the register
//               will automatically clear to 0.
#define OTP_SBPI_RDATA_0_OFFSET _u(0x00000114)
#define OTP_SBPI_RDATA_0_BITS   _u(0xffffffff)
#define OTP_SBPI_RDATA_0_RESET  _u(0x00000000)
#define OTP_SBPI_RDATA_0_MSB    _u(31)
#define OTP_SBPI_RDATA_0_LSB    _u(0)
#define OTP_SBPI_RDATA_0_ACCESS "RO"
// =============================================================================
// Register    : OTP_SBPI_RDATA_1
// Description : Read payload bytes 7..4. Once read, the data in the register
//               will automatically clear to 0.
#define OTP_SBPI_RDATA_1_OFFSET _u(0x00000118)
#define OTP_SBPI_RDATA_1_BITS   _u(0xffffffff)
#define OTP_SBPI_RDATA_1_RESET  _u(0x00000000)
#define OTP_SBPI_RDATA_1_MSB    _u(31)
#define OTP_SBPI_RDATA_1_LSB    _u(0)
#define OTP_SBPI_RDATA_1_ACCESS "RO"
// =============================================================================
// Register    : OTP_SBPI_RDATA_2
// Description : Read payload bytes 11..8. Once read, the data in the register
//               will automatically clear to 0.
#define OTP_SBPI_RDATA_2_OFFSET _u(0x0000011c)
#define OTP_SBPI_RDATA_2_BITS   _u(0xffffffff)
#define OTP_SBPI_RDATA_2_RESET  _u(0x00000000)
#define OTP_SBPI_RDATA_2_MSB    _u(31)
#define OTP_SBPI_RDATA_2_LSB    _u(0)
#define OTP_SBPI_RDATA_2_ACCESS "RO"
// =============================================================================
// Register    : OTP_SBPI_RDATA_3
// Description : Read payload bytes 15..12. Once read, the data in the register
//               will automatically clear to 0.
#define OTP_SBPI_RDATA_3_OFFSET _u(0x00000120)
#define OTP_SBPI_RDATA_3_BITS   _u(0xffffffff)
#define OTP_SBPI_RDATA_3_RESET  _u(0x00000000)
#define OTP_SBPI_RDATA_3_MSB    _u(31)
#define OTP_SBPI_RDATA_3_LSB    _u(0)
#define OTP_SBPI_RDATA_3_ACCESS "RO"
// =============================================================================
// Register    : OTP_SBPI_STATUS
#define OTP_SBPI_STATUS_OFFSET _u(0x00000124)
#define OTP_SBPI_STATUS_BITS   _u(0x00ff1111)
#define OTP_SBPI_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_STATUS_MISO
// Description : SBPI MISO (master in - slave out): response from SBPI
#define OTP_SBPI_STATUS_MISO_RESET  "-"
#define OTP_SBPI_STATUS_MISO_BITS   _u(0x00ff0000)
#define OTP_SBPI_STATUS_MISO_MSB    _u(23)
#define OTP_SBPI_STATUS_MISO_LSB    _u(16)
#define OTP_SBPI_STATUS_MISO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_STATUS_FLAG
// Description : SBPI flag
#define OTP_SBPI_STATUS_FLAG_RESET  "-"
#define OTP_SBPI_STATUS_FLAG_BITS   _u(0x00001000)
#define OTP_SBPI_STATUS_FLAG_MSB    _u(12)
#define OTP_SBPI_STATUS_FLAG_LSB    _u(12)
#define OTP_SBPI_STATUS_FLAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_STATUS_INSTR_MISS
// Description : Last instruction missed (dropped), as the previous has not
//               finished running
#define OTP_SBPI_STATUS_INSTR_MISS_RESET  _u(0x0)
#define OTP_SBPI_STATUS_INSTR_MISS_BITS   _u(0x00000100)
#define OTP_SBPI_STATUS_INSTR_MISS_MSB    _u(8)
#define OTP_SBPI_STATUS_INSTR_MISS_LSB    _u(8)
#define OTP_SBPI_STATUS_INSTR_MISS_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_STATUS_INSTR_DONE
// Description : Last instruction done
#define OTP_SBPI_STATUS_INSTR_DONE_RESET  _u(0x0)
#define OTP_SBPI_STATUS_INSTR_DONE_BITS   _u(0x00000010)
#define OTP_SBPI_STATUS_INSTR_DONE_MSB    _u(4)
#define OTP_SBPI_STATUS_INSTR_DONE_LSB    _u(4)
#define OTP_SBPI_STATUS_INSTR_DONE_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_SBPI_STATUS_RDATA_VLD
// Description : Read command has returned data
#define OTP_SBPI_STATUS_RDATA_VLD_RESET  _u(0x0)
#define OTP_SBPI_STATUS_RDATA_VLD_BITS   _u(0x00000001)
#define OTP_SBPI_STATUS_RDATA_VLD_MSB    _u(0)
#define OTP_SBPI_STATUS_RDATA_VLD_LSB    _u(0)
#define OTP_SBPI_STATUS_RDATA_VLD_ACCESS "WC"
// =============================================================================
// Register    : OTP_USR
// Description : Controls for APB data read interface (USER interface)
#define OTP_USR_OFFSET _u(0x00000128)
#define OTP_USR_BITS   _u(0x00000011)
#define OTP_USR_RESET  _u(0x00000001)
// -----------------------------------------------------------------------------
// Field       : OTP_USR_PD
// Description : Power-down; 1 disables current reference. Must be 0 to read
//               data from the OTP.
#define OTP_USR_PD_RESET  _u(0x0)
#define OTP_USR_PD_BITS   _u(0x00000010)
#define OTP_USR_PD_MSB    _u(4)
#define OTP_USR_PD_LSB    _u(4)
#define OTP_USR_PD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_USR_DCTRL
// Description : 1 enables USER interface; 0 disables USER interface (enables
//               SBPI).
//
//               This bit must be cleared before performing any SBPI access,
//               such as when programming the OTP. The APB data read interface
//               (USER interface) will be inaccessible during this time, and
//               will return a bus error if any read is attempted.
#define OTP_USR_DCTRL_RESET  _u(0x1)
#define OTP_USR_DCTRL_BITS   _u(0x00000001)
#define OTP_USR_DCTRL_MSB    _u(0)
#define OTP_USR_DCTRL_LSB    _u(0)
#define OTP_USR_DCTRL_ACCESS "RW"
// =============================================================================
// Register    : OTP_DBG
// Description : Debug for OTP power-on state machine
#define OTP_DBG_OFFSET _u(0x0000012c)
#define OTP_DBG_BITS   _u(0x000010ff)
#define OTP_DBG_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_CUSTOMER_RMA_FLAG
// Description : The chip is in RMA mode
#define OTP_DBG_CUSTOMER_RMA_FLAG_RESET  "-"
#define OTP_DBG_CUSTOMER_RMA_FLAG_BITS   _u(0x00001000)
#define OTP_DBG_CUSTOMER_RMA_FLAG_MSB    _u(12)
#define OTP_DBG_CUSTOMER_RMA_FLAG_LSB    _u(12)
#define OTP_DBG_CUSTOMER_RMA_FLAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_PSM_STATE
// Description : Monitor the PSM FSM's state
#define OTP_DBG_PSM_STATE_RESET  "-"
#define OTP_DBG_PSM_STATE_BITS   _u(0x000000f0)
#define OTP_DBG_PSM_STATE_MSB    _u(7)
#define OTP_DBG_PSM_STATE_LSB    _u(4)
#define OTP_DBG_PSM_STATE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_ROSC_UP
// Description : Ring oscillator is up and running
#define OTP_DBG_ROSC_UP_RESET  "-"
#define OTP_DBG_ROSC_UP_BITS   _u(0x00000008)
#define OTP_DBG_ROSC_UP_MSB    _u(3)
#define OTP_DBG_ROSC_UP_LSB    _u(3)
#define OTP_DBG_ROSC_UP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_ROSC_UP_SEEN
// Description : Ring oscillator was seen up and running
#define OTP_DBG_ROSC_UP_SEEN_RESET  _u(0x0)
#define OTP_DBG_ROSC_UP_SEEN_BITS   _u(0x00000004)
#define OTP_DBG_ROSC_UP_SEEN_MSB    _u(2)
#define OTP_DBG_ROSC_UP_SEEN_LSB    _u(2)
#define OTP_DBG_ROSC_UP_SEEN_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_BOOT_DONE
// Description : PSM boot done status flag
#define OTP_DBG_BOOT_DONE_RESET  "-"
#define OTP_DBG_BOOT_DONE_BITS   _u(0x00000002)
#define OTP_DBG_BOOT_DONE_MSB    _u(1)
#define OTP_DBG_BOOT_DONE_LSB    _u(1)
#define OTP_DBG_BOOT_DONE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_DBG_PSM_DONE
// Description : PSM done status flag
#define OTP_DBG_PSM_DONE_RESET  "-"
#define OTP_DBG_PSM_DONE_BITS   _u(0x00000001)
#define OTP_DBG_PSM_DONE_MSB    _u(0)
#define OTP_DBG_PSM_DONE_LSB    _u(0)
#define OTP_DBG_PSM_DONE_ACCESS "RO"
// =============================================================================
// Register    : OTP_BIST
// Description : During BIST, count address locations that have at least one
//               leaky bit
#define OTP_BIST_OFFSET _u(0x00000134)
#define OTP_BIST_BITS   _u(0x7fff1fff)
#define OTP_BIST_RESET  _u(0x0fff0000)
// -----------------------------------------------------------------------------
// Field       : OTP_BIST_CNT_FAIL
// Description : Flag if the count of address locations with at least one leaky
//               bit exceeds cnt_max
#define OTP_BIST_CNT_FAIL_RESET  "-"
#define OTP_BIST_CNT_FAIL_BITS   _u(0x40000000)
#define OTP_BIST_CNT_FAIL_MSB    _u(30)
#define OTP_BIST_CNT_FAIL_LSB    _u(30)
#define OTP_BIST_CNT_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_BIST_CNT_CLR
// Description : Clear counter before use
#define OTP_BIST_CNT_CLR_RESET  _u(0x0)
#define OTP_BIST_CNT_CLR_BITS   _u(0x20000000)
#define OTP_BIST_CNT_CLR_MSB    _u(29)
#define OTP_BIST_CNT_CLR_LSB    _u(29)
#define OTP_BIST_CNT_CLR_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : OTP_BIST_CNT_ENA
// Description : Enable the counter before the BIST function is initiated
#define OTP_BIST_CNT_ENA_RESET  _u(0x0)
#define OTP_BIST_CNT_ENA_BITS   _u(0x10000000)
#define OTP_BIST_CNT_ENA_MSB    _u(28)
#define OTP_BIST_CNT_ENA_LSB    _u(28)
#define OTP_BIST_CNT_ENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_BIST_CNT_MAX
// Description : The cnt_fail flag will be set if the number of leaky locations
//               exceeds this number
#define OTP_BIST_CNT_MAX_RESET  _u(0xfff)
#define OTP_BIST_CNT_MAX_BITS   _u(0x0fff0000)
#define OTP_BIST_CNT_MAX_MSB    _u(27)
#define OTP_BIST_CNT_MAX_LSB    _u(16)
#define OTP_BIST_CNT_MAX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_BIST_CNT
// Description : Number of locations that have at least one leaky bit. Note:
//               This count is true only if the BIST was initiated without the
//               fix option.
#define OTP_BIST_CNT_RESET  "-"
#define OTP_BIST_CNT_BITS   _u(0x00001fff)
#define OTP_BIST_CNT_MSB    _u(12)
#define OTP_BIST_CNT_LSB    _u(0)
#define OTP_BIST_CNT_ACCESS "RO"
// =============================================================================
// Register    : OTP_CRT_KEY_W0
// Description : Word 0 (bits 31..0) of the key. Write only, read returns 0x0
#define OTP_CRT_KEY_W0_OFFSET _u(0x00000138)
#define OTP_CRT_KEY_W0_BITS   _u(0xffffffff)
#define OTP_CRT_KEY_W0_RESET  _u(0x00000000)
#define OTP_CRT_KEY_W0_MSB    _u(31)
#define OTP_CRT_KEY_W0_LSB    _u(0)
#define OTP_CRT_KEY_W0_ACCESS "WO"
// =============================================================================
// Register    : OTP_CRT_KEY_W1
// Description : Word 1 (bits 63..32) of the key. Write only, read returns 0x0
#define OTP_CRT_KEY_W1_OFFSET _u(0x0000013c)
#define OTP_CRT_KEY_W1_BITS   _u(0xffffffff)
#define OTP_CRT_KEY_W1_RESET  _u(0x00000000)
#define OTP_CRT_KEY_W1_MSB    _u(31)
#define OTP_CRT_KEY_W1_LSB    _u(0)
#define OTP_CRT_KEY_W1_ACCESS "WO"
// =============================================================================
// Register    : OTP_CRT_KEY_W2
// Description : Word 2 (bits 95..64) of the key. Write only, read returns 0x0
#define OTP_CRT_KEY_W2_OFFSET _u(0x00000140)
#define OTP_CRT_KEY_W2_BITS   _u(0xffffffff)
#define OTP_CRT_KEY_W2_RESET  _u(0x00000000)
#define OTP_CRT_KEY_W2_MSB    _u(31)
#define OTP_CRT_KEY_W2_LSB    _u(0)
#define OTP_CRT_KEY_W2_ACCESS "WO"
// =============================================================================
// Register    : OTP_CRT_KEY_W3
// Description : Word 3 (bits 127..96) of the key. Write only, read returns 0x0
#define OTP_CRT_KEY_W3_OFFSET _u(0x00000144)
#define OTP_CRT_KEY_W3_BITS   _u(0xffffffff)
#define OTP_CRT_KEY_W3_RESET  _u(0x00000000)
#define OTP_CRT_KEY_W3_MSB    _u(31)
#define OTP_CRT_KEY_W3_LSB    _u(0)
#define OTP_CRT_KEY_W3_ACCESS "WO"
// =============================================================================
// Register    : OTP_CRITICAL
// Description : Quickly check values of critical flags read during boot up
#define OTP_CRITICAL_OFFSET _u(0x00000148)
#define OTP_CRITICAL_BITS   _u(0x0003007f)
#define OTP_CRITICAL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_RISCV_DISABLE
#define OTP_CRITICAL_RISCV_DISABLE_RESET  _u(0x0)
#define OTP_CRITICAL_RISCV_DISABLE_BITS   _u(0x00020000)
#define OTP_CRITICAL_RISCV_DISABLE_MSB    _u(17)
#define OTP_CRITICAL_RISCV_DISABLE_LSB    _u(17)
#define OTP_CRITICAL_RISCV_DISABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_ARM_DISABLE
#define OTP_CRITICAL_ARM_DISABLE_RESET  _u(0x0)
#define OTP_CRITICAL_ARM_DISABLE_BITS   _u(0x00010000)
#define OTP_CRITICAL_ARM_DISABLE_MSB    _u(16)
#define OTP_CRITICAL_ARM_DISABLE_LSB    _u(16)
#define OTP_CRITICAL_ARM_DISABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_GLITCH_DETECTOR_SENS
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_RESET  _u(0x0)
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_BITS   _u(0x00000060)
