Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_MSB    _u(6)
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_LSB    _u(5)
#define OTP_CRITICAL_GLITCH_DETECTOR_SENS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_GLITCH_DETECTOR_ENABLE
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_RESET  _u(0x0)
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_BITS   _u(0x00000010)
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_MSB    _u(4)
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_LSB    _u(4)
#define OTP_CRITICAL_GLITCH_DETECTOR_ENABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_DEFAULT_ARCHSEL
#define OTP_CRITICAL_DEFAULT_ARCHSEL_RESET  _u(0x0)
#define OTP_CRITICAL_DEFAULT_ARCHSEL_BITS   _u(0x00000008)
#define OTP_CRITICAL_DEFAULT_ARCHSEL_MSB    _u(3)
#define OTP_CRITICAL_DEFAULT_ARCHSEL_LSB    _u(3)
#define OTP_CRITICAL_DEFAULT_ARCHSEL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_DEBUG_DISABLE
#define OTP_CRITICAL_DEBUG_DISABLE_RESET  _u(0x0)
#define OTP_CRITICAL_DEBUG_DISABLE_BITS   _u(0x00000004)
#define OTP_CRITICAL_DEBUG_DISABLE_MSB    _u(2)
#define OTP_CRITICAL_DEBUG_DISABLE_LSB    _u(2)
#define OTP_CRITICAL_DEBUG_DISABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_SECURE_DEBUG_DISABLE
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_RESET  _u(0x0)
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_BITS   _u(0x00000002)
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_MSB    _u(1)
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_LSB    _u(1)
#define OTP_CRITICAL_SECURE_DEBUG_DISABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_CRITICAL_SECURE_BOOT_ENABLE
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_RESET  _u(0x0)
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_BITS   _u(0x00000001)
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_MSB    _u(0)
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_LSB    _u(0)
#define OTP_CRITICAL_SECURE_BOOT_ENABLE_ACCESS "RO"
// =============================================================================
// Register    : OTP_KEY_VALID
// Description : Which keys were valid (enrolled) at boot time
#define OTP_KEY_VALID_OFFSET _u(0x0000014c)
#define OTP_KEY_VALID_BITS   _u(0x000000ff)
#define OTP_KEY_VALID_RESET  _u(0x00000000)
#define OTP_KEY_VALID_MSB    _u(7)
#define OTP_KEY_VALID_LSB    _u(0)
#define OTP_KEY_VALID_ACCESS "RO"
// =============================================================================
// Register    : OTP_DEBUGEN
// Description : Enable a debug feature that has been disabled. Debug features
//               are disabled if one of the relevant critical boot flags is set
//               in OTP (DEBUG_DISABLE or SECURE_DEBUG_DISABLE), OR if a debug
//               key is marked valid in OTP, and the matching key value has not
//               been supplied over SWD.
//
//               Specifically:
//
//               - The DEBUG_DISABLE flag disables all debug features. This can
//               be fully overridden by setting all bits of this register.
//
//               - The SECURE_DEBUG_DISABLE flag disables secure processor
//               debug. This can be fully overridden by setting the PROC0_SECURE
//               and PROC1_SECURE bits of this register.
//
//               - If a single debug key has been registered, and no matching
//               key value has been supplied over SWD, then all debug features
//               are disabled. This can be fully overridden by setting all bits
//               of this register.
//
//               - If both debug keys have been registered, and the Non-secure
//               key's value (key 6) has been supplied over SWD, secure
//               processor debug is disabled. This can be fully overridden by
//               setting the PROC0_SECURE and PROC1_SECURE bits of this
//               register.
//
//               - If both debug keys have been registered, and the Secure key's
//               value (key 5) has been supplied over SWD, then no debug
//               features are disabled by the key mechanism. However, note that
//               in this case debug features may still be disabled by the
//               critical boot flags.
#define OTP_DEBUGEN_OFFSET _u(0x00000150)
#define OTP_DEBUGEN_BITS   _u(0x0000010f)
#define OTP_DEBUGEN_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_MISC
// Description : Enable other debug components. Specifically, the CTI, and the
//               APB-AP used to access the RISC-V Debug Module.
//
//               These components are disabled by default if either of the debug
//               disable critical flags is set, or if at least one debug key has
//               been enrolled and the least secure of these enrolled key values
//               has not been provided over SWD.
#define OTP_DEBUGEN_MISC_RESET  _u(0x0)
#define OTP_DEBUGEN_MISC_BITS   _u(0x00000100)
#define OTP_DEBUGEN_MISC_MSB    _u(8)
#define OTP_DEBUGEN_MISC_LSB    _u(8)
#define OTP_DEBUGEN_MISC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_PROC1_SECURE
// Description : Permit core 1's Mem-AP to generate Secure accesses, assuming it
//               is enabled at all. Also enable secure debug of core 1 (SPIDEN
//               and SPNIDEN).
//
//               Secure debug of core 1 is disabled by default if the secure
//               debug disable critical flag is set, or if at least one debug
//               key has been enrolled and the most secure of these enrolled key
//               values not yet provided over SWD.
#define OTP_DEBUGEN_PROC1_SECURE_RESET  _u(0x0)
#define OTP_DEBUGEN_PROC1_SECURE_BITS   _u(0x00000008)
#define OTP_DEBUGEN_PROC1_SECURE_MSB    _u(3)
#define OTP_DEBUGEN_PROC1_SECURE_LSB    _u(3)
#define OTP_DEBUGEN_PROC1_SECURE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_PROC1
// Description : Enable core 1's Mem-AP if it is currently disabled.
//
//               The Mem-AP is disabled by default if either of the debug
//               disable critical flags is set, or if at least one debug key has
//               been enrolled and the least secure of these enrolled key values
//               has not been provided over SWD.
#define OTP_DEBUGEN_PROC1_RESET  _u(0x0)
#define OTP_DEBUGEN_PROC1_BITS   _u(0x00000004)
#define OTP_DEBUGEN_PROC1_MSB    _u(2)
#define OTP_DEBUGEN_PROC1_LSB    _u(2)
#define OTP_DEBUGEN_PROC1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_PROC0_SECURE
// Description : Permit core 0's Mem-AP to generate Secure accesses, assuming it
//               is enabled at all. Also enable secure debug of core 0 (SPIDEN
//               and SPNIDEN).
//
//               Secure debug of core 0 is disabled by default if the secure
//               debug disable critical flag is set, or if at least one debug
//               key has been enrolled and the most secure of these enrolled key
//               values not yet provided over SWD.
//
//               Note also that core Mem-APs are unconditionally disabled when a
//               core is switched to RISC-V mode (by setting the ARCHSEL bit and
//               performing a warm reset of the core).
#define OTP_DEBUGEN_PROC0_SECURE_RESET  _u(0x0)
#define OTP_DEBUGEN_PROC0_SECURE_BITS   _u(0x00000002)
#define OTP_DEBUGEN_PROC0_SECURE_MSB    _u(1)
#define OTP_DEBUGEN_PROC0_SECURE_LSB    _u(1)
#define OTP_DEBUGEN_PROC0_SECURE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_PROC0
// Description : Enable core 0's Mem-AP if it is currently disabled.
//
//               The Mem-AP is disabled by default if either of the debug
//               disable critical flags is set, or if at least one debug key has
//               been enrolled and the least secure of these enrolled key values
//               has not been provided over SWD.
//
//               Note also that core Mem-APs are unconditionally disabled when a
//               core is switched to RISC-V mode (by setting the ARCHSEL bit and
//               performing a warm reset of the core).
#define OTP_DEBUGEN_PROC0_RESET  _u(0x0)
#define OTP_DEBUGEN_PROC0_BITS   _u(0x00000001)
#define OTP_DEBUGEN_PROC0_MSB    _u(0)
#define OTP_DEBUGEN_PROC0_LSB    _u(0)
#define OTP_DEBUGEN_PROC0_ACCESS "RW"
// =============================================================================
// Register    : OTP_DEBUGEN_LOCK
// Description : Write 1s to lock corresponding bits in DEBUGEN. This register
//               is reset by the processor cold reset.
#define OTP_DEBUGEN_LOCK_OFFSET _u(0x00000154)
#define OTP_DEBUGEN_LOCK_BITS   _u(0x0000010f)
#define OTP_DEBUGEN_LOCK_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_LOCK_MISC
// Description : Write 1 to lock the MISC bit of DEBUGEN. Can't be cleared once
//               set.
#define OTP_DEBUGEN_LOCK_MISC_RESET  _u(0x0)
#define OTP_DEBUGEN_LOCK_MISC_BITS   _u(0x00000100)
#define OTP_DEBUGEN_LOCK_MISC_MSB    _u(8)
#define OTP_DEBUGEN_LOCK_MISC_LSB    _u(8)
#define OTP_DEBUGEN_LOCK_MISC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_LOCK_PROC1_SECURE
// Description : Write 1 to lock the PROC1_SECURE bit of DEBUGEN. Can't be
//               cleared once set.
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_RESET  _u(0x0)
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_BITS   _u(0x00000008)
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_MSB    _u(3)
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_LSB    _u(3)
#define OTP_DEBUGEN_LOCK_PROC1_SECURE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_LOCK_PROC1
// Description : Write 1 to lock the PROC1 bit of DEBUGEN. Can't be cleared once
//               set.
#define OTP_DEBUGEN_LOCK_PROC1_RESET  _u(0x0)
#define OTP_DEBUGEN_LOCK_PROC1_BITS   _u(0x00000004)
#define OTP_DEBUGEN_LOCK_PROC1_MSB    _u(2)
#define OTP_DEBUGEN_LOCK_PROC1_LSB    _u(2)
#define OTP_DEBUGEN_LOCK_PROC1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_LOCK_PROC0_SECURE
// Description : Write 1 to lock the PROC0_SECURE bit of DEBUGEN. Can't be
//               cleared once set.
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_RESET  _u(0x0)
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_BITS   _u(0x00000002)
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_MSB    _u(1)
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_LSB    _u(1)
#define OTP_DEBUGEN_LOCK_PROC0_SECURE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_DEBUGEN_LOCK_PROC0
// Description : Write 1 to lock the PROC0 bit of DEBUGEN. Can't be cleared once
//               set.
#define OTP_DEBUGEN_LOCK_PROC0_RESET  _u(0x0)
#define OTP_DEBUGEN_LOCK_PROC0_BITS   _u(0x00000001)
#define OTP_DEBUGEN_LOCK_PROC0_MSB    _u(0)
#define OTP_DEBUGEN_LOCK_PROC0_LSB    _u(0)
#define OTP_DEBUGEN_LOCK_PROC0_ACCESS "RW"
// =============================================================================
// Register    : OTP_ARCHSEL
// Description : Architecture select (Arm/RISC-V). The default and allowable
//               values of this register are constrained by the critical boot
//               flags.
//
//               This register is reset by the earliest reset in the switched
//               core power domain (before a processor cold reset).
//
//               Cores sample their architecture select signal on a warm reset.
//               The source of the warm reset could be the system power-up state
//               machine, the watchdog timer, Arm SYSRESETREQ or from RISC-V
//               hartresetreq.
//
//               Note that when an Arm core is deselected, its cold reset domain
//               is also held in reset, since in particular the SYSRESETREQ bit
//               becomes inaccessible once the core is deselected. Note also the
//               RISC-V cores do not have a cold reset domain, since their
//               corresponding controls are located in the Debug Module.
#define OTP_ARCHSEL_OFFSET _u(0x00000158)
#define OTP_ARCHSEL_BITS   _u(0x00000003)
#define OTP_ARCHSEL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_ARCHSEL_CORE1
// Description : Select architecture for core 1.
//               0x0 -> Switch core 1 to Arm (Cortex-M33)
//               0x1 -> Switch core 1 to RISC-V (Hazard3)
#define OTP_ARCHSEL_CORE1_RESET  _u(0x0)
#define OTP_ARCHSEL_CORE1_BITS   _u(0x00000002)
#define OTP_ARCHSEL_CORE1_MSB    _u(1)
#define OTP_ARCHSEL_CORE1_LSB    _u(1)
#define OTP_ARCHSEL_CORE1_ACCESS "RW"
#define OTP_ARCHSEL_CORE1_VALUE_ARM _u(0x0)
#define OTP_ARCHSEL_CORE1_VALUE_RISCV _u(0x1)
// -----------------------------------------------------------------------------
// Field       : OTP_ARCHSEL_CORE0
// Description : Select architecture for core 0.
//               0x0 -> Switch core 0 to Arm (Cortex-M33)
//               0x1 -> Switch core 0 to RISC-V (Hazard3)
#define OTP_ARCHSEL_CORE0_RESET  _u(0x0)
#define OTP_ARCHSEL_CORE0_BITS   _u(0x00000001)
#define OTP_ARCHSEL_CORE0_MSB    _u(0)
#define OTP_ARCHSEL_CORE0_LSB    _u(0)
#define OTP_ARCHSEL_CORE0_ACCESS "RW"
#define OTP_ARCHSEL_CORE0_VALUE_ARM _u(0x0)
#define OTP_ARCHSEL_CORE0_VALUE_RISCV _u(0x1)
// =============================================================================
// Register    : OTP_ARCHSEL_STATUS
// Description : Get the current architecture select state of each core. Cores
//               sample the current value of the ARCHSEL register when their
//               warm reset is released, at which point the corresponding bit in
//               this register will also update.
#define OTP_ARCHSEL_STATUS_OFFSET _u(0x0000015c)
#define OTP_ARCHSEL_STATUS_BITS   _u(0x00000003)
#define OTP_ARCHSEL_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_ARCHSEL_STATUS_CORE1
// Description : Current architecture for core 0. Updated on processor warm
//               reset.
//               0x0 -> Core 1 is currently Arm (Cortex-M33)
//               0x1 -> Core 1 is currently RISC-V (Hazard3)
#define OTP_ARCHSEL_STATUS_CORE1_RESET  _u(0x0)
#define OTP_ARCHSEL_STATUS_CORE1_BITS   _u(0x00000002)
#define OTP_ARCHSEL_STATUS_CORE1_MSB    _u(1)
#define OTP_ARCHSEL_STATUS_CORE1_LSB    _u(1)
#define OTP_ARCHSEL_STATUS_CORE1_ACCESS "RO"
#define OTP_ARCHSEL_STATUS_CORE1_VALUE_ARM _u(0x0)
#define OTP_ARCHSEL_STATUS_CORE1_VALUE_RISCV _u(0x1)
// -----------------------------------------------------------------------------
// Field       : OTP_ARCHSEL_STATUS_CORE0
// Description : Current architecture for core 0. Updated on processor warm
//               reset.
//               0x0 -> Core 0 is currently Arm (Cortex-M33)
//               0x1 -> Core 0 is currently RISC-V (Hazard3)
#define OTP_ARCHSEL_STATUS_CORE0_RESET  _u(0x0)
#define OTP_ARCHSEL_STATUS_CORE0_BITS   _u(0x00000001)
#define OTP_ARCHSEL_STATUS_CORE0_MSB    _u(0)
#define OTP_ARCHSEL_STATUS_CORE0_LSB    _u(0)
#define OTP_ARCHSEL_STATUS_CORE0_ACCESS "RO"
#define OTP_ARCHSEL_STATUS_CORE0_VALUE_ARM _u(0x0)
#define OTP_ARCHSEL_STATUS_CORE0_VALUE_RISCV _u(0x1)
// =============================================================================
// Register    : OTP_BOOTDIS
// Description : Tell the bootrom to ignore scratch register boot vectors (both
//               power manager and watchdog) on the next power up.
//
//               If an early boot stage has soft-locked some OTP pages in order
//               to protect their contents from later stages, there is a risk
//               that Secure code running at a later stage can unlock the pages
//               by performing a watchdog reset that resets the OTP.
//
//               This register can be used to ensure that the bootloader runs as
//               normal on the next power up, preventing Secure code at a later
//               stage from accessing OTP in its unlocked state.
//
//               Should be used in conjunction with the power manager BOOTDIS
//               register.
#define OTP_BOOTDIS_OFFSET _u(0x00000160)
#define OTP_BOOTDIS_BITS   _u(0x00000003)
#define OTP_BOOTDIS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_BOOTDIS_NEXT
// Description : This flag always ORs writes into its current contents. It can
//               be set but not cleared by software.
//
//               The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the
//               core is powered down. Simultaneously, the BOOTDIS_NEXT bit is
//               cleared. Setting this bit means that the boot scratch registers
//               will be ignored following the next core power down.
//
//               This flag should be set by an early boot stage that has soft-
//               locked OTP pages, to prevent later stages from unlocking it via
//               watchdog reset.
#define OTP_BOOTDIS_NEXT_RESET  _u(0x0)
#define OTP_BOOTDIS_NEXT_BITS   _u(0x00000002)
#define OTP_BOOTDIS_NEXT_MSB    _u(1)
#define OTP_BOOTDIS_NEXT_LSB    _u(1)
#define OTP_BOOTDIS_NEXT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_BOOTDIS_NOW
// Description : When the core is powered down, the current value of
//               BOOTDIS_NEXT is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is
//               cleared.
//
//               The bootrom checks this flag before reading the boot scratch
//               registers. If it is set, the bootrom clears it, and ignores the
//               BOOT registers. This prevents Secure software from diverting
//               the boot path before a bootloader has had the chance to soft
//               lock OTP pages containing sensitive data.
#define OTP_BOOTDIS_NOW_RESET  _u(0x0)
#define OTP_BOOTDIS_NOW_BITS   _u(0x00000001)
#define OTP_BOOTDIS_NOW_MSB    _u(0)
#define OTP_BOOTDIS_NOW_LSB    _u(0)
#define OTP_BOOTDIS_NOW_ACCESS "WC"
// =============================================================================
// Register    : OTP_INTR
// Description : Raw Interrupts
#define OTP_INTR_OFFSET _u(0x00000164)
#define OTP_INTR_BITS   _u(0x0000001f)
#define OTP_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_INTR_APB_RD_NSEC_FAIL
#define OTP_INTR_APB_RD_NSEC_FAIL_RESET  _u(0x0)
#define OTP_INTR_APB_RD_NSEC_FAIL_BITS   _u(0x00000010)
#define OTP_INTR_APB_RD_NSEC_FAIL_MSB    _u(4)
#define OTP_INTR_APB_RD_NSEC_FAIL_LSB    _u(4)
#define OTP_INTR_APB_RD_NSEC_FAIL_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_INTR_APB_RD_SEC_FAIL
#define OTP_INTR_APB_RD_SEC_FAIL_RESET  _u(0x0)
#define OTP_INTR_APB_RD_SEC_FAIL_BITS   _u(0x00000008)
#define OTP_INTR_APB_RD_SEC_FAIL_MSB    _u(3)
#define OTP_INTR_APB_RD_SEC_FAIL_LSB    _u(3)
#define OTP_INTR_APB_RD_SEC_FAIL_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_INTR_APB_DCTRL_FAIL
#define OTP_INTR_APB_DCTRL_FAIL_RESET  _u(0x0)
#define OTP_INTR_APB_DCTRL_FAIL_BITS   _u(0x00000004)
#define OTP_INTR_APB_DCTRL_FAIL_MSB    _u(2)
#define OTP_INTR_APB_DCTRL_FAIL_LSB    _u(2)
#define OTP_INTR_APB_DCTRL_FAIL_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_INTR_SBPI_WR_FAIL
#define OTP_INTR_SBPI_WR_FAIL_RESET  _u(0x0)
#define OTP_INTR_SBPI_WR_FAIL_BITS   _u(0x00000002)
#define OTP_INTR_SBPI_WR_FAIL_MSB    _u(1)
#define OTP_INTR_SBPI_WR_FAIL_LSB    _u(1)
#define OTP_INTR_SBPI_WR_FAIL_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : OTP_INTR_SBPI_FLAG_N
#define OTP_INTR_SBPI_FLAG_N_RESET  _u(0x0)
#define OTP_INTR_SBPI_FLAG_N_BITS   _u(0x00000001)
#define OTP_INTR_SBPI_FLAG_N_MSB    _u(0)
#define OTP_INTR_SBPI_FLAG_N_LSB    _u(0)
#define OTP_INTR_SBPI_FLAG_N_ACCESS "RO"
// =============================================================================
// Register    : OTP_INTE
// Description : Interrupt Enable
#define OTP_INTE_OFFSET _u(0x00000168)
#define OTP_INTE_BITS   _u(0x0000001f)
#define OTP_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_INTE_APB_RD_NSEC_FAIL
#define OTP_INTE_APB_RD_NSEC_FAIL_RESET  _u(0x0)
#define OTP_INTE_APB_RD_NSEC_FAIL_BITS   _u(0x00000010)
#define OTP_INTE_APB_RD_NSEC_FAIL_MSB    _u(4)
#define OTP_INTE_APB_RD_NSEC_FAIL_LSB    _u(4)
#define OTP_INTE_APB_RD_NSEC_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTE_APB_RD_SEC_FAIL
#define OTP_INTE_APB_RD_SEC_FAIL_RESET  _u(0x0)
#define OTP_INTE_APB_RD_SEC_FAIL_BITS   _u(0x00000008)
#define OTP_INTE_APB_RD_SEC_FAIL_MSB    _u(3)
#define OTP_INTE_APB_RD_SEC_FAIL_LSB    _u(3)
#define OTP_INTE_APB_RD_SEC_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTE_APB_DCTRL_FAIL
#define OTP_INTE_APB_DCTRL_FAIL_RESET  _u(0x0)
#define OTP_INTE_APB_DCTRL_FAIL_BITS   _u(0x00000004)
#define OTP_INTE_APB_DCTRL_FAIL_MSB    _u(2)
#define OTP_INTE_APB_DCTRL_FAIL_LSB    _u(2)
#define OTP_INTE_APB_DCTRL_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTE_SBPI_WR_FAIL
#define OTP_INTE_SBPI_WR_FAIL_RESET  _u(0x0)
#define OTP_INTE_SBPI_WR_FAIL_BITS   _u(0x00000002)
#define OTP_INTE_SBPI_WR_FAIL_MSB    _u(1)
#define OTP_INTE_SBPI_WR_FAIL_LSB    _u(1)
#define OTP_INTE_SBPI_WR_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTE_SBPI_FLAG_N
#define OTP_INTE_SBPI_FLAG_N_RESET  _u(0x0)
#define OTP_INTE_SBPI_FLAG_N_BITS   _u(0x00000001)
#define OTP_INTE_SBPI_FLAG_N_MSB    _u(0)
#define OTP_INTE_SBPI_FLAG_N_LSB    _u(0)
#define OTP_INTE_SBPI_FLAG_N_ACCESS "RW"
// =============================================================================
// Register    : OTP_INTF
// Description : Interrupt Force
#define OTP_INTF_OFFSET _u(0x0000016c)
#define OTP_INTF_BITS   _u(0x0000001f)
#define OTP_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_INTF_APB_RD_NSEC_FAIL
#define OTP_INTF_APB_RD_NSEC_FAIL_RESET  _u(0x0)
#define OTP_INTF_APB_RD_NSEC_FAIL_BITS   _u(0x00000010)
#define OTP_INTF_APB_RD_NSEC_FAIL_MSB    _u(4)
#define OTP_INTF_APB_RD_NSEC_FAIL_LSB    _u(4)
#define OTP_INTF_APB_RD_NSEC_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTF_APB_RD_SEC_FAIL
#define OTP_INTF_APB_RD_SEC_FAIL_RESET  _u(0x0)
#define OTP_INTF_APB_RD_SEC_FAIL_BITS   _u(0x00000008)
#define OTP_INTF_APB_RD_SEC_FAIL_MSB    _u(3)
#define OTP_INTF_APB_RD_SEC_FAIL_LSB    _u(3)
#define OTP_INTF_APB_RD_SEC_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTF_APB_DCTRL_FAIL
#define OTP_INTF_APB_DCTRL_FAIL_RESET  _u(0x0)
#define OTP_INTF_APB_DCTRL_FAIL_BITS   _u(0x00000004)
