Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/otp.h
#define OTP_INTF_APB_DCTRL_FAIL_MSB    _u(2)
#define OTP_INTF_APB_DCTRL_FAIL_LSB    _u(2)
#define OTP_INTF_APB_DCTRL_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTF_SBPI_WR_FAIL
#define OTP_INTF_SBPI_WR_FAIL_RESET  _u(0x0)
#define OTP_INTF_SBPI_WR_FAIL_BITS   _u(0x00000002)
#define OTP_INTF_SBPI_WR_FAIL_MSB    _u(1)
#define OTP_INTF_SBPI_WR_FAIL_LSB    _u(1)
#define OTP_INTF_SBPI_WR_FAIL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : OTP_INTF_SBPI_FLAG_N
#define OTP_INTF_SBPI_FLAG_N_RESET  _u(0x0)
#define OTP_INTF_SBPI_FLAG_N_BITS   _u(0x00000001)
#define OTP_INTF_SBPI_FLAG_N_MSB    _u(0)
#define OTP_INTF_SBPI_FLAG_N_LSB    _u(0)
#define OTP_INTF_SBPI_FLAG_N_ACCESS "RW"
// =============================================================================
// Register    : OTP_INTS
// Description : Interrupt status after masking & forcing
#define OTP_INTS_OFFSET _u(0x00000170)
#define OTP_INTS_BITS   _u(0x0000001f)
#define OTP_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : OTP_INTS_APB_RD_NSEC_FAIL
#define OTP_INTS_APB_RD_NSEC_FAIL_RESET  _u(0x0)
#define OTP_INTS_APB_RD_NSEC_FAIL_BITS   _u(0x00000010)
#define OTP_INTS_APB_RD_NSEC_FAIL_MSB    _u(4)
#define OTP_INTS_APB_RD_NSEC_FAIL_LSB    _u(4)
#define OTP_INTS_APB_RD_NSEC_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_INTS_APB_RD_SEC_FAIL
#define OTP_INTS_APB_RD_SEC_FAIL_RESET  _u(0x0)
#define OTP_INTS_APB_RD_SEC_FAIL_BITS   _u(0x00000008)
#define OTP_INTS_APB_RD_SEC_FAIL_MSB    _u(3)
#define OTP_INTS_APB_RD_SEC_FAIL_LSB    _u(3)
#define OTP_INTS_APB_RD_SEC_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_INTS_APB_DCTRL_FAIL
#define OTP_INTS_APB_DCTRL_FAIL_RESET  _u(0x0)
#define OTP_INTS_APB_DCTRL_FAIL_BITS   _u(0x00000004)
#define OTP_INTS_APB_DCTRL_FAIL_MSB    _u(2)
#define OTP_INTS_APB_DCTRL_FAIL_LSB    _u(2)
#define OTP_INTS_APB_DCTRL_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_INTS_SBPI_WR_FAIL
#define OTP_INTS_SBPI_WR_FAIL_RESET  _u(0x0)
#define OTP_INTS_SBPI_WR_FAIL_BITS   _u(0x00000002)
#define OTP_INTS_SBPI_WR_FAIL_MSB    _u(1)
#define OTP_INTS_SBPI_WR_FAIL_LSB    _u(1)
#define OTP_INTS_SBPI_WR_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : OTP_INTS_SBPI_FLAG_N
#define OTP_INTS_SBPI_FLAG_N_RESET  _u(0x0)
#define OTP_INTS_SBPI_FLAG_N_BITS   _u(0x00000001)
#define OTP_INTS_SBPI_FLAG_N_MSB    _u(0)
#define OTP_INTS_SBPI_FLAG_N_LSB    _u(0)
#define OTP_INTS_SBPI_FLAG_N_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_OTP_H

